In [258]:
# importing packages

import pandas as pd # Data Manipulations
import numpy as np # Data calculations

import datetime # Datetime transformations

In [259]:
# csv files - semistructured data

In [260]:
# Reading csv files

cust = pd.read_csv("C://projects//jan_ml//data//input//Customer.csv")
prod = pd.read_csv("C://projects//jan_ml//data//input/Product.csv")
trans = pd.read_csv("C://projects//jan_ml//data//input/Transactions.csv")

In [261]:
# Meta Data Inspection

# Dimensions of the dataframes

print(f"The dimensions of the customer dataframe {cust.shape}")
print(f"The dimensions of the transactions dataframe {trans.shape}")
print(f"The dimensions of the products dataframe {prod.shape}")

The dimensions of the customer dataframe (22604, 8)
The dimensions of the transactions dataframe (742018, 10)
The dimensions of the products dataframe (42681, 7)

In [262]:
# Data Types for each dataframe

cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22604 entries, 0 to 22603
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Customer ID      22604 non-null  int64
 1   Gender           22604 non-null  object
 2   first Date       22604 non-null  int64
 3   recent date      22604 non-null  int64
 4   Customer value   22604 non-null  float64
 5   buy times        22604 non-null  int64
 6   Points earned    22604 non-null  int64
 7   Points redeemed  2996 non-null   float64
dtypes: float64(2), int64(5), object(1)
memory usage: 1.4+ MB

In [263]:
cust.head(1)

,Customer ID,Gender,first Date,recent date,Customer value,buy times,Points earned,Points redeemed
0,85498466,M,20120101,20120101,15.9,1,135,NaN

In [264]:
# Observation for data type conversions
# first Date and recent date

In [265]:
cust.isnull().sum()

Customer ID            0
Gender                 0
first Date             0
recent date            0
Customer value         0
buy times              0
Points earned          0
Points redeemed    19608
dtype: int64

In [266]:
# Missing value imputation for Points redeemed
# Column names has to cleaned - replace spaces with underscore

In [267]:
cust.duplicated().sum()

0

In [268]:
# Transactions table

In [269]:
trans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 742018 entries, 0 to 742017
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   USER_ID           742018 non-null  int64
 1   order id          742018 non-null  int64
 2   merchant id       742018 non-null  int64
 3   product id        742018 non-null  int64
 4   order time        742018 non-null  int64
 5   sale amount       742018 non-null  float64
 6   sale price        742018 non-null  float64
 7   sale number       742018 non-null  int64
 8   web portal price  742018 non-null  float64
 9   ACTIVITY ID       742018 non-null  int64
dtypes: float64(3), int64(7)
memory usage: 56.6 MB

In [270]:
trans.head(1)

,USER_ID,order id,merchant id,product id,order time,sale amount,sale price,sale number,web portal price,ACTIVITY ID
0,12592130,29501392,1,1143312,20120102,0.0,0.0,1,0.0,14647

In [271]:
# Datatype conversion
# order time

In [272]:
#trans.loc[trans['order id'] == 30103270]

In [273]:
trans.duplicated().sum()

858

In [274]:
trans.loc[trans.duplicated() == True]

,USER_ID,order id,merchant id,product id,order time,sale amount,sale price,sale number,web portal price,ACTIVITY ID
8255,70298640,30103270,1,1724981,20120106,0.00,0.00,1,0.0,999999999
14598,55736017,30732672,1,5970,20120110,10.50,10.50,1,11.5,12639
19743,392496,31464420,1,1215123,20120116,59.70,19.90,3,29.9,999999999
25664,8851068,31978748,1,953621,20120124,6.94,6.94,1,6.9,999999999
43737,73829292,33794322,1,1000590,20120210,2.50,2.50,1,2.5,999999999
...,...,...,...,...,...,...,...,...,...,...
730856,7381807,106480772,1,4122179,20130326,0.00,0.00,1,0.0,999999999
731996,132254737,106547195,1,18925,20130326,19.50,19.50,1,23.0,74863
732093,121500029,106641097,1,1057751,20130327,39.50,39.50,1,62.0,74864
734107,22958,106657480,1,4814,20130327,19.50,19.50,1,26.0,74863
734344,123379022,106718602,1,4122179,20130327,0.00,0.00,1,0.0,999999999

In [275]:
# Drop duplicates in trans table

In [276]:
trans.isnull().sum()

USER_ID             0
order id            0
merchant id         0
product id          0
order time          0
sale amount         0
sale price          0
sale number         0
web portal price    0
ACTIVITY ID         0
dtype: int64

In [277]:
# Products table

In [278]:
prod.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42681 entries, 0 to 42680
Data columns (total 7 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   PRODUCT_ID                42681 non-null  int64
 1   PRODUCT_CODE              42681 non-null  int64
 2   merchant id               42681 non-null  int64
 3   merchant_name_eng         42681 non-null  object
 4   Category_level2_name_eng  42681 non-null  object
 5   cost price                42505 non-null  float64
 6   Category_code             42681 non-null  int64
dtypes: float64(1), int64(4), object(2)
memory usage: 2.3+ MB

In [279]:
prod.head(1)

,PRODUCT_ID,PRODUCT_CODE,merchant id,merchant_name_eng,Category_level2_name_eng,cost price,Category_code
0,973607,9736076,1,Delhi,Nutrition and health (No.1 Medicine Store),31.122,17

In [280]:
# list duplicates
prod.duplicated().sum()

0

In [281]:
# missing values
prod.isnull().sum()

PRODUCT_ID                    0
PRODUCT_CODE                  0
merchant id                   0
merchant_name_eng             0
Category_level2_name_eng      0
cost price                  176
Category_code                 0
dtype: int64

In [282]:
prod.loc[prod['cost price'].isnull()]

,PRODUCT_ID,PRODUCT_CODE,merchant id,merchant_name_eng,Category_level2_name_eng,cost price,Category_code
42505,1016687,10166877,1,Delhi,Household electrical appliances,NaN,9
42506,2293884,22938847,2,Bangalore,Mother and children,NaN,7
42507,1119493,11194937,1,Delhi,Home,NaN,2
42508,1575388,15753885,1,Delhi,Home,NaN,2
42509,1403241,14032418,1,Delhi,Nutrition and health,NaN,13
...,...,...,...,...,...,...,...
42676,1285136,12851364,1,Delhi,Nutrition and health,NaN,13
42677,1337041,13370417,1,Delhi,Nutrition and health,NaN,13
42678,1676838,16768380,1,Delhi,Mother and children,NaN,7
42679,1312157,13121578,1,Delhi,Household electrical appliances,NaN,9
42680,1285253,12852538,1,Delhi,Nutrition and health,NaN,13

In [283]:
# Missing values
# We need to drop off these records post checking product ids in trans
# no presence in trans table and then drop off

In [284]:
# Data Cleaning

# Variable name has spaces , replace spaces with underscore - Done
# Date type conversion for trans and cust - Done
# Deduplication - Done
# Missing value imputations - Done

In [285]:
# Variable name has spaces , replace spaces with underscore

In [286]:
cust.columns

Index(['Customer ID', 'Gender', 'first Date', 'recent date', 'Customer value',
       'buy times', 'Points earned', 'Points redeemed'],
      dtype='object')

In [287]:
# replace
for col in cust.columns:
    print(col.replace(" ","_"))

Customer_ID
Gender
first_Date
recent_date
Customer_value
buy_times
Points_earned
Points_redeemed

In [288]:
# List comprehension

[col.replace(" ","_") for col in cust.columns]

['Customer_ID',
 'Gender',
 'first_Date',
 'recent_date',
 'Customer_value',
 'buy_times',
 'Points_earned',
 'Points_redeemed']

In [289]:
prod.columns

Index(['PRODUCT_ID', 'PRODUCT_CODE', 'merchant id', 'merchant_name_eng',
       'Category_level2_name_eng', 'cost price', 'Category_code'],
      dtype='object')

In [290]:
cust_cols = [col.replace(" ","_") for col in cust.columns]
prod_cols = [col.replace(" ","_") for col in prod.columns]
trans_cols = [col.replace(" ","_") for col in trans.columns]

In [291]:
cust_cols

['Customer_ID',
 'Gender',
 'first_Date',
 'recent_date',
 'Customer_value',
 'buy_times',
 'Points_earned',
 'Points_redeemed']

In [292]:
prod_cols

['PRODUCT_ID',
 'PRODUCT_CODE',
 'merchant_id',
 'merchant_name_eng',
 'Category_level2_name_eng',
 'cost_price',
 'Category_code']

In [293]:
trans_cols

['USER_ID',
 'order_id',
 'merchant_id',
 'product_id',
 'order_time',
 'sale_amount',
 'sale_price',
 'sale_number',
 'web_portal_price',
 'ACTIVITY_ID']

In [294]:
cust.columns = cust_cols

In [295]:
cust.head()

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed
0,85498466,M,20120101,20120101,15.9000,1,135,NaN
1,14634939,M,20120102,20130227,4454.0996,35,2130,11.0
2,14860694,F,20120103,20130219,2756.2800,19,987,785.0
3,85570763,M,20120103,20120406,902.3000,6,240,NaN
4,85796047,M,20120106,20120106,39.8000,1,40,NaN

In [296]:
trans.head()

,USER_ID,order id,merchant id,product id,order time,sale amount,sale price,sale number,web portal price,ACTIVITY ID
0,12592130,29501392,1,1143312,20120102,0.00,0.00,1,0.0,14647
1,36438353,29482570,1,1739650,20120102,0.00,0.00,1,69.0,14264
2,73897605,29453567,1,1288235,20120102,0.31,0.51,1,5.1,13679
3,85462069,29506684,1,964626,20120102,0.89,1.00,1,1.7,10885
4,70491566,29412642,1,14264,20120101,1.20,1.20,1,9.9,10818

In [297]:
trans.columns = trans_cols

In [298]:
trans.head(1)

,USER_ID,order_id,merchant_id,product_id,order_time,sale_amount,sale_price,sale_number,web_portal_price,ACTIVITY_ID
0,12592130,29501392,1,1143312,20120102,0.0,0.0,1,0.0,14647

In [299]:
prod.columns

Index(['PRODUCT_ID', 'PRODUCT_CODE', 'merchant id', 'merchant_name_eng',
       'Category_level2_name_eng', 'cost price', 'Category_code'],
      dtype='object')

In [300]:
prod.head(1)

,PRODUCT_ID,PRODUCT_CODE,merchant id,merchant_name_eng,Category_level2_name_eng,cost price,Category_code
0,973607,9736076,1,Delhi,Nutrition and health (No.1 Medicine Store),31.122,17

In [301]:
prod.columns = prod_cols

In [302]:
prod.head(1)

,PRODUCT_ID,PRODUCT_CODE,merchant_id,merchant_name_eng,Category_level2_name_eng,cost_price,Category_code
0,973607,9736076,1,Delhi,Nutrition and health (No.1 Medicine Store),31.122,17

In [303]:
# Date type conversion for trans and cust

In [304]:
cust.head(2)

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed
0,85498466,M,20120101,20120101,15.9000,1,135,NaN
1,14634939,M,20120102,20130227,4454.0996,35,2130,11.0

In [305]:
#yyyymmdd

In [306]:
cust.dtypes

Customer_ID          int64
Gender              object
first_Date           int64
recent_date          int64
Customer_value     float64
buy_times            int64
Points_earned        int64
Points_redeemed    float64
dtype: object

In [307]:
# Converting a field to datetime datatype -- source int64 / number

In [308]:
cust['first_Date'].head()

0    20120101
1    20120102
2    20120103
3    20120103
4    20120106
Name: first_Date, dtype: int64

In [309]:
# Firstly convert your datetime field from number to string, then proceed
cust['first_Date'] = cust['first_Date'].astype(str)
cust['recent_date'] = cust['recent_date'].astype(str)

In [310]:
cust.first_Date.head(2)

0    20120101
1    20120102
Name: first_Date, dtype: object

In [311]:
cust['first_Date'] =   pd.to_datetime(cust['first_Date'], format = "%Y%m%d")

In [312]:
cust.recent_date.head(2)

0    20120101
1    20130227
Name: recent_date, dtype: object

In [313]:
cust['recent_date'] =   pd.to_datetime(cust['recent_date'], format = "%Y%m%d")

In [314]:
cust.dtypes

Customer_ID                 int64
Gender                     object
first_Date         datetime64[ns]
recent_date        datetime64[ns]
Customer_value            float64
buy_times                   int64
Points_earned               int64
Points_redeemed           float64
dtype: object

In [315]:
cust.first_Date

0       2012-01-01
1       2012-01-02
2       2012-01-03
3       2012-01-03
4       2012-01-06
           ...
22599   2013-03-19
22600   2013-03-20
22601   2013-03-25
22602   2013-03-29
22603   2013-03-31
Name: first_Date, Length: 22604, dtype: datetime64[ns]

In [316]:
# transactions datetime conversion

In [317]:
trans.head(1)

,USER_ID,order_id,merchant_id,product_id,order_time,sale_amount,sale_price,sale_number,web_portal_price,ACTIVITY_ID
0,12592130,29501392,1,1143312,20120102,0.0,0.0,1,0.0,14647

In [318]:
trans['order_time'] = trans['order_time'].astype(str)

In [319]:
trans.dtypes

USER_ID               int64
order_id              int64
merchant_id           int64
product_id            int64
order_time           object
sale_amount         float64
sale_price          float64
sale_number           int64
web_portal_price    float64
ACTIVITY_ID           int64
dtype: object

In [320]:
trans['order_time'] = pd.to_datetime(trans['order_time'], format = '%Y%m%d')

In [321]:
trans.dtypes

USER_ID                      int64
order_id                     int64
merchant_id                  int64
product_id                   int64
order_time          datetime64[ns]
sale_amount                float64
sale_price                 float64
sale_number                  int64
web_portal_price           float64
ACTIVITY_ID                  int64
dtype: object

In [322]:
# Deduplication

In [323]:
cust.duplicated().sum()

0

In [324]:
trans.duplicated().sum()

858

In [325]:
trans.shape

(742018, 10)

In [326]:
# Drop the duplicate record
trans_dedup = trans.drop_duplicates()

In [327]:
trans_dedup.duplicated().sum()

0

In [328]:
trans_dedup.shape

(741160, 10)

In [329]:
# prod

prod.duplicated().sum()

0

In [330]:
# Missing value treatment

cust.isnull().sum()

Customer_ID            0
Gender                 0
first_Date             0
recent_date            0
Customer_value         0
buy_times              0
Points_earned          0
Points_redeemed    19608
dtype: int64

In [331]:
# Replace points_redeemed with value 0

In [332]:
cust['Points_redeemed'].fillna(0, inplace = True)

C:\Users\ravul\AppData\Local\Temp\ipykernel_16356\1543112344.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  cust['Points_redeemed'].fillna(0, inplace = True)

In [333]:
cust.isnull().sum()

Customer_ID        0
Gender             0
first_Date         0
recent_date        0
Customer_value     0
buy_times          0
Points_earned      0
Points_redeemed    0
dtype: int64

In [334]:
trans.isnull().sum()

USER_ID             0
order_id            0
merchant_id         0
product_id          0
order_time          0
sale_amount         0
sale_price          0
sale_number         0
web_portal_price    0
ACTIVITY_ID         0
dtype: int64

In [335]:
prod.isnull().sum()

PRODUCT_ID                    0
PRODUCT_CODE                  0
merchant_id                   0
merchant_name_eng             0
Category_level2_name_eng      0
cost_price                  176
Category_code                 0
dtype: int64

In [336]:
trans.head(2)

,USER_ID,order_id,merchant_id,product_id,order_time,sale_amount,sale_price,sale_number,web_portal_price,ACTIVITY_ID
0,12592130,29501392,1,1143312,2012-01-02,0.0,0.0,1,0.0,14647
1,36438353,29482570,1,1739650,2012-01-02,0.0,0.0,1,69.0,14264

In [337]:
trans.columns

Index(['USER_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID'],
      dtype='object')

In [338]:
# Promotion is applied when the number other than 99999999
# No promotion - 99999999
# Promotion - 15267, 13210,.....

In [339]:
# Some more manipulations

# Create new columns/fields/features/variables

# margin - (Sales_amount - Cost_amount)
# act_amount - (web_portal_price*sale_number)
# discount - (sale_amount - act_amount)
# Promotion_Flag(99999999- No Promotion, Promotion)
# Week_day_num - weekend, weekday, <=5

#Consider transaction time period only for 1 year (between 01APR2012 and 31MAR2013)

In [340]:
trans_dedup['order_time'].max()

Timestamp('2013-03-31 00:00:00')

In [341]:
trans_dedup['order_time'].min()

Timestamp('2011-12-05 00:00:00')

In [342]:
# Filter the trans data as per proposed date
# 01APR2012 and 31MAR2013
trans_dedup = trans_dedup.loc[trans_dedup['order_time'] >= '2012-04-01']

In [343]:
trans_dedup['order_time'].describe()

count                           631301
mean     2012-10-11 11:45:35.932939008
min                2012-04-01 00:00:00
25%                2012-07-18 00:00:00
50%                2012-10-19 00:00:00
75%                2013-01-07 00:00:00
max                2013-03-31 00:00:00
Name: order_time, dtype: object

In [344]:
# margin - (Sales_amount - Cost_amount) - post merging
# act_amount - (web_portal_price*sale_number) - Done
# discount - (sale_amount - act_amount) - Done
# Promotion_Flag(99999999- No Promotion, Promotion) - Done
# Week_day_num - weekend, weekday, <=5 - Done

In [345]:
# act_amount

In [346]:
trans.head()

,USER_ID,order_id,merchant_id,product_id,order_time,sale_amount,sale_price,sale_number,web_portal_price,ACTIVITY_ID
0,12592130,29501392,1,1143312,2012-01-02,0.00,0.00,1,0.0,14647
1,36438353,29482570,1,1739650,2012-01-02,0.00,0.00,1,69.0,14264
2,73897605,29453567,1,1288235,2012-01-02,0.31,0.51,1,5.1,13679
3,85462069,29506684,1,964626,2012-01-02,0.89,1.00,1,1.7,10885
4,70491566,29412642,1,14264,2012-01-01,1.20,1.20,1,9.9,10818

In [347]:
trans_dedup['act_amt'] = trans_dedup.web_portal_price* trans_dedup.sale_number

In [348]:
trans_dedup.columns

Index(['USER_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt'],
      dtype='object')

In [349]:
trans_dedup['disc_amt'] =    trans_dedup.act_amt - trans_dedup.sale_amount

In [350]:
trans_dedup.columns

Index(['USER_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt'],
      dtype='object')

In [351]:
# Promotion_Flag(99999999- No Promotion, Promotion)

In [352]:
trans_dedup['ACTIVITY_ID'].head(5)

109498        21882
109499        19545
109501    999999999
109502    999999999
109503    999999999
Name: ACTIVITY_ID, dtype: int64

In [353]:
np.where((trans_dedup['ACTIVITY_ID'] == 999999999), "No Promo", "Promo")

array(['Promo', 'Promo', 'No Promo', ..., 'No Promo', 'No Promo', 'Promo'],
      dtype='<U8')

In [354]:
trans_dedup['Promotion_Flag'] = np.where((trans_dedup['ACTIVITY_ID'] == 999999999), "No Promo", "Promo")

In [355]:
trans_dedup.columns

Index(['USER_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt', 'Promotion_Flag'],
      dtype='object')

In [356]:
trans_dedup.head()

,USER_ID,order_id,merchant_id,product_id,order_time,sale_amount,sale_price,sale_number,web_portal_price,ACTIVITY_ID,act_amt,disc_amt,Promotion_Flag
109498,85317795,42140644,1,2122894,2012-04-01,0.0,0.0,1,0.0,21882,0.0,0.0,Promo
109499,5936910,42110258,1,954701,2012-04-01,0.0,0.0,1,2.9,19545,2.9,2.9,Promo
109501,74062770,42100394,1,1166338,2012-04-01,12.0,6.0,2,6.0,999999999,12.0,0.0,No Promo
109502,50096376,42101420,1,966234,2012-04-01,14.0,14.0,1,14.0,999999999,14.0,0.0,No Promo
109503,9612320,42138710,1,1110030,2012-04-01,18.0,18.0,1,22.0,999999999,22.0,4.0,No Promo

In [357]:
# Week_flag - weekend, weekday, <=5

In [358]:
trans_dedup['week_flag'] = np.where((trans_dedup['order_time'].dt.dayofweek <=5),"weekday","weekend")

In [359]:
trans_dedup.columns

Index(['USER_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt', 'Promotion_Flag', 'week_flag'],
      dtype='object')

In [360]:
trans_dedup.head()

,USER_ID,order_id,merchant_id,product_id,order_time,sale_amount,sale_price,sale_number,web_portal_price,ACTIVITY_ID,act_amt,disc_amt,Promotion_Flag,week_flag
109498,85317795,42140644,1,2122894,2012-04-01,0.0,0.0,1,0.0,21882,0.0,0.0,Promo,weekend
109499,5936910,42110258,1,954701,2012-04-01,0.0,0.0,1,2.9,19545,2.9,2.9,Promo,weekend
109501,74062770,42100394,1,1166338,2012-04-01,12.0,6.0,2,6.0,999999999,12.0,0.0,No Promo,weekend
109502,50096376,42101420,1,966234,2012-04-01,14.0,14.0,1,14.0,999999999,14.0,0.0,No Promo,weekend
109503,9612320,42138710,1,1110030,2012-04-01,18.0,18.0,1,22.0,999999999,22.0,4.0,No Promo,weekend

In [361]:
# Sales Returns is useful or sales with zeros

In [362]:
cust[cust['Customer_value']<=0]

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed
499,128616214,F,2013-01-10,2013-01-10,0.0,1,2,0.0
8136,116865059,M,2012-06-20,2012-06-24,-8.0,2,62,0.0
11106,10937460,M,2012-07-23,2012-07-23,0.0,1,10,0.0
16268,120020551,M,2012-08-08,2012-08-09,0.0,3,10,0.0
16438,118180537,M,2012-07-03,2012-07-03,0.0,1,0,0.0
20653,129010616,M,2013-01-17,2013-01-17,0.0,1,0,0.0

In [363]:
trans_dedup[trans_dedup['sale_amount']==0]

,USER_ID,order_id,merchant_id,product_id,order_time,sale_amount,sale_price,sale_number,web_portal_price,ACTIVITY_ID,act_amt,disc_amt,Promotion_Flag,week_flag
109498,85317795,42140644,1,2122894,2012-04-01,0.0,0.0,1,0.0,21882,0.0,0.0,Promo,weekend
109499,5936910,42110258,1,954701,2012-04-01,0.0,0.0,1,2.9,19545,2.9,2.9,Promo,weekend
109541,9008712,42135548,1,1991725,2012-04-01,0.0,0.0,1,4.5,21138,4.5,4.5,Promo,weekend
109589,1621503,42132248,1,1944419,2012-04-01,0.0,0.0,1,0.0,18967,0.0,0.0,Promo,weekend
109624,12646522,42168855,1,2026006,2012-04-01,0.0,0.0,1,5.8,20662,5.8,5.8,Promo,weekend
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
742009,73776523,107378505,1,2026006,2013-03-31,0.0,0.0,1,5.8,82637,5.8,5.8,Promo,weekend
742011,73776523,107378505,1,7012878,2013-03-31,0.0,0.0,1,0.0,82600,0.0,0.0,Promo,weekend
742012,73776523,107378505,1,7205878,2013-03-31,0.0,0.0,1,0.0,77751,0.0,0.0,Promo,weekend
742013,73776523,107378505,1,7243798,2013-03-31,0.0,0.0,1,0.0,77916,0.0,0.0,Promo,weekend
742017,6843775,107432203,1,3974589,2013-03-31,0.0,0.0,1,39.0,71114,39.0,39.0,Promo,weekend

In [364]:
cust

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed
0,85498466,M,2012-01-01,2012-01-01,15.9000,1,135,0.0
1,14634939,M,2012-01-02,2013-02-27,4454.0996,35,2130,11.0
2,14860694,F,2012-01-03,2013-02-19,2756.2800,19,987,785.0
3,85570763,M,2012-01-03,2012-04-06,902.3000,6,240,0.0
4,85796047,M,2012-01-06,2012-01-06,39.8000,1,40,0.0
...,...,...,...,...,...,...,...,...
22599,131299892,M,2013-03-19,2013-03-19,214.6000,1,160,0.0
22600,6728191,F,2013-03-20,2013-03-20,103.5000,1,180,0.0
22601,132194046,M,2013-03-25,2013-03-25,164.0000,1,175,0.0
22602,131041807,M,2013-03-29,2013-03-29,300.0000,1,315,0.0
22603,132490575,M,2013-03-31,2013-03-31,62.8000,1,50,0.0

In [365]:
# Drop the non value records in both customer and transaction with zeros

cust = cust[cust['Customer_value'] > 0] # Take only customer whose value is GE 0
trans_dedup = trans_dedup[trans_dedup['sale_amount']!=0] # Take only those customer with non zero

In [366]:
cust.shape

(22598, 8)

In [367]:
trans_dedup.shape

(576816, 14)

In [368]:
# Two more cleaning things before looking at instructions

# Category Mapping - Products table - Done
# transactions table - create what is the first_purchase_date_flag and recent_date_purchase_flag - not userid

In [369]:
prod.head()

,PRODUCT_ID,PRODUCT_CODE,merchant_id,merchant_name_eng,Category_level2_name_eng,cost_price,Category_code
0,973607,9736076,1,Delhi,Nutrition and health (No.1 Medicine Store),31.122,17
1,860,8606,1,Delhi,Beauty,7.500,12
2,861,8617,1,Delhi,Beauty,8.250,12
3,864,8640,1,Delhi,Beauty,11.925,12
4,865,8651,1,Delhi,Beauty,9.750,12

In [370]:
prod['Category_level2_name_eng'].value_counts()

Category_level2_name_eng
Food                                          8537
Beauty                                        6996
Kitchen cleaning                              4591
Imported food                                 4503
Home                                          4330
Mother and children                           3763
Drinks                                        3126
Household electrical appliances               2036
Computers, software, office supplies          1757
Nutrition and health                          1263
Digital                                        573
Mobile phones                                  547
Car related products                           404
Clothing and shoes                             193
No.1 Gift Center                                45
Nutrition and health (No.1 Medicine Store)       4
Vitamins, calcium (No.1 Medicine Store)          4
Medical equipment (No.1 Medicine Store)          3
Groupon_Digital (to be confirmed)                3
Adult products (No.1 Medicine Store)             1
Luggage, jewelry, watches and clocks             1
Pingan 3G                                        1
Name: count, dtype: int64

In [371]:
# Joins, map, apply,

# np.where

In [372]:
prod['new_category'] = np.where(
    prod['Category_level2_name_eng'] == "Food", "Food",
    np.where(
        prod['Category_level2_name_eng'] == "Kitchen cleaning", "Kitchen_Clean",
        np.where(
            prod['Category_level2_name_eng'] == "Beauty", "Beauty",
            np.where(
                prod['Category_level2_name_eng'] == "Imported food", "Imported_Food",
                np.where(
                    prod['Category_level2_name_eng'] == "Drinks", "Drinks",
                    np.where(
                        prod['Category_level2_name_eng'] == "Mother and children", "Mother_Child",
                        np.where(
                            prod['Category_level2_name_eng'] == "Home", "Home",
                            np.where(
                                prod['Category_level2_name_eng'] == "Nutrition and health", "Nutrition",
                                np.where(
                                    prod['Category_level2_name_eng'] == "Household electrical appliances", "HH_Electrical",
                                    np.where(
                                        prod['Category_level2_name_eng'] == "Computers, software, office supplies", "Office_Computer",
                                        np.where(
                                            prod['Category_level2_name_eng'] == "Digital", "Digital",
                                            np.where(
                                                prod['Category_level2_name_eng'] == "Mobile phones", "Mobiles",
                                                np.where(
                                                    prod['Category_level2_name_eng'] == "Car related products", "Car_prods",
                                                    "Others"
                                                )
                                            )
                                        )
                                    )
                                )
                            )
                        )
                    )
                )
            )
        )
    )
)

In [373]:
prod.head()

,PRODUCT_ID,PRODUCT_CODE,merchant_id,merchant_name_eng,Category_level2_name_eng,cost_price,Category_code,new_category
0,973607,9736076,1,Delhi,Nutrition and health (No.1 Medicine Store),31.122,17,Others
1,860,8606,1,Delhi,Beauty,7.500,12,Beauty
2,861,8617,1,Delhi,Beauty,8.250,12,Beauty
3,864,8640,1,Delhi,Beauty,11.925,12,Beauty
4,865,8651,1,Delhi,Beauty,9.750,12,Beauty

In [374]:
# sample = pd.DataFrame({"Name" : ['Raj',"Shyam"],"Salary" : [200,200]})
# sample

In [375]:
# {i:j for i,j in zip(sample['Name'], sample['Salary'])}
# cate_series.map({i:j for i,j in zip(sample['Name'], sample['Salary'])})

In [376]:
# transactions table - create what is the first_purchase_date_flag and recent_date_purchase_flag - not userid

In [377]:
trans_dedup['order_time'].min()

Timestamp('2012-04-01 00:00:00')

In [378]:
trans_dedup['order_time'].max()

Timestamp('2013-03-31 00:00:00')

In [379]:
trans_dedup.loc[:,'first_purchase_flag'] = np.where(trans_dedup['order_time'] == trans_dedup['order_time'].min(),1,0)

In [380]:
trans_dedup.loc[:,'latest_purchase_flag'] = np.where(trans_dedup['order_time'] == trans_dedup['order_time'].max(),1,0)

In [381]:
trans_dedup.head()

,USER_ID,order_id,merchant_id,product_id,order_time,sale_amount,sale_price,sale_number,web_portal_price,ACTIVITY_ID,act_amt,disc_amt,Promotion_Flag,week_flag,first_purchase_flag,latest_purchase_flag
109501,74062770,42100394,1,1166338,2012-04-01,12.0,6.0,2,6.0,999999999,12.0,0.0,No Promo,weekend,1,0
109502,50096376,42101420,1,966234,2012-04-01,14.0,14.0,1,14.0,999999999,14.0,0.0,No Promo,weekend,1,0
109503,9612320,42138710,1,1110030,2012-04-01,18.0,18.0,1,22.0,999999999,22.0,4.0,No Promo,weekend,1,0
109506,633411,42150617,1,1858194,2012-04-01,1.5,1.5,1,1.5,999999999,1.5,0.0,No Promo,weekend,1,0
109507,91060281,42114460,1,9336,2012-04-01,2.6,2.6,1,2.6,999999999,2.6,0.0,No Promo,weekend,1,0

In [382]:
# margin - (Sales_amount - Cost_amount) - post merging
# act_amount - (web_portal_price*sale_number) - Done
# discount - (sale_amount - act_amount) - Done
# Promotion_Flag(99999999- No Promotion, Promotion) - Done
# Week_day_num - weekend, weekday, <=5 - Done
# Category Mapping - Products table - Done
# transactions table - create what is the first_purchase_date_flag and recent_date_purchase_flag - not userid - Done

In [383]:
# Join  trans and prod

In [384]:
cust['Customer_ID'].value_counts()

Customer_ID
85498466     1
120895926    1
132418734    1
117298540    1
131633962    1
            ..
130318699    1
50285015     1
5050134      1
129716918    1
132490575    1
Name: count, Length: 22598, dtype: int64

In [385]:
# Join trans and prod

In [386]:
trans_dedup.columns

Index(['USER_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt', 'Promotion_Flag', 'week_flag',
       'first_purchase_flag', 'latest_purchase_flag'],
      dtype='object')

In [387]:
trans_dedup.rename(columns = {'USER_ID':"Customer_ID"}, inplace = True)

In [388]:
trans_dedup.columns

Index(['Customer_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt', 'Promotion_Flag', 'week_flag',
       'first_purchase_flag', 'latest_purchase_flag'],
      dtype='object')

In [389]:
# Join transaction with products table

In [390]:
prod.columns

Index(['PRODUCT_ID', 'PRODUCT_CODE', 'merchant_id', 'merchant_name_eng',
       'Category_level2_name_eng', 'cost_price', 'Category_code',
       'new_category'],
      dtype='object')

In [391]:
prod.head()

,PRODUCT_ID,PRODUCT_CODE,merchant_id,merchant_name_eng,Category_level2_name_eng,cost_price,Category_code,new_category
0,973607,9736076,1,Delhi,Nutrition and health (No.1 Medicine Store),31.122,17,Others
1,860,8606,1,Delhi,Beauty,7.500,12,Beauty
2,861,8617,1,Delhi,Beauty,8.250,12,Beauty
3,864,8640,1,Delhi,Beauty,11.925,12,Beauty
4,865,8651,1,Delhi,Beauty,9.750,12,Beauty

In [392]:
pd.merge

<function pandas.core.reshape.merge.merge(left: 'DataFrame | Series', right: 'DataFrame | Series', how: 'MergeHow' = 'inner', on: 'IndexLabel | AnyArrayLike | None' = None, left_on: 'IndexLabel | AnyArrayLike | None' = None, right_on: 'IndexLabel | AnyArrayLike | None' = None, left_index: 'bool' = False, right_index: 'bool' = False, sort: 'bool' = False, suffixes: 'Suffixes' = ('_x', '_y'), copy: 'bool | None' = None, indicator: 'str | bool' = False, validate: 'str | None' = None) -> 'DataFrame'>

In [393]:
trans_dedup.columns

Index(['Customer_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt', 'Promotion_Flag', 'week_flag',
       'first_purchase_flag', 'latest_purchase_flag'],
      dtype='object')

In [394]:
trans_dedup['product_id'].head(1)

109501    1166338
Name: product_id, dtype: int64

In [395]:
prod.columns

Index(['PRODUCT_ID', 'PRODUCT_CODE', 'merchant_id', 'merchant_name_eng',
       'Category_level2_name_eng', 'cost_price', 'Category_code',
       'new_category'],
      dtype='object')

In [396]:
trans_master = trans_dedup.merge(prod[['PRODUCT_ID', 'PRODUCT_CODE', 'merchant_id', 'merchant_name_eng'
                  , 'cost_price','new_category']], left_on = ['merchant_id', 'product_id'],
            right_on = ['merchant_id','PRODUCT_ID'], how = 'left')

In [397]:
trans_master.columns

Index(['Customer_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt', 'Promotion_Flag', 'week_flag',
       'first_purchase_flag', 'latest_purchase_flag', 'PRODUCT_ID',
       'PRODUCT_CODE', 'merchant_name_eng', 'cost_price', 'new_category'],
      dtype='object')

In [398]:
# Continued 31st Jan 2026

In [399]:
# Questions - what is the data range interms of date we have considered

In [400]:
# 01APR2012 and 31MAR2013

In [401]:
#Period1: order_date>='01APR2012'  and order_date<='30SEP2012'
#Period2: order_date>='01OCT2012'  and order_date<='31MAR2013'

In [402]:
#trans_master - combined table of transactions and products

In [403]:
trans_master.columns

Index(['Customer_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt', 'Promotion_Flag', 'week_flag',
       'first_purchase_flag', 'latest_purchase_flag', 'PRODUCT_ID',
       'PRODUCT_CODE', 'merchant_name_eng', 'cost_price', 'new_category'],
      dtype='object')

In [404]:
# Create a column that has P1 and P2 based on time duration as specified above

#Period1: order_date>='01APR2012'  and order_date<='30SEP2012' - P1
#Period2: order_date>='01OCT2012'  and order_date<='31MAR2013' - P2

In [405]:
# np.where

In [406]:
trans_master.dtypes

Customer_ID                      int64
order_id                         int64
merchant_id                      int64
product_id                       int64
order_time              datetime64[ns]
sale_amount                    float64
sale_price                     float64
sale_number                      int64
web_portal_price               float64
ACTIVITY_ID                      int64
act_amt                        float64
disc_amt                       float64
Promotion_Flag                  object
week_flag                       object
first_purchase_flag              int32
latest_purchase_flag             int32
PRODUCT_ID                       int64
PRODUCT_CODE                     int64
merchant_name_eng               object
cost_price                     float64
new_category                    object
dtype: object

In [407]:
trans_master['order_time'].head()

0   2012-04-01
1   2012-04-01
2   2012-04-01
3   2012-04-01
4   2012-04-01
Name: order_time, dtype: datetime64[ns]

In [408]:
# TimePeriod

In [409]:
np.where(((trans_master['order_time'] >= "2012-04-01") &\
          (trans_master['order_time'] <= "2012-09-30")),"P1","P2")

array(['P1', 'P1', 'P1', ..., 'P2', 'P2', 'P2'], dtype='<U2')

In [410]:
trans_master['TimePeriod'] = np.where(((trans_master['order_time'] >= "2012-04-01") &\
          (trans_master['order_time'] <= "2012-09-30")),"P1","P2")

In [411]:
trans_master.tail()

,Customer_ID,order_id,merchant_id,product_id,order_time,sale_amount,sale_price,sale_number,web_portal_price,ACTIVITY_ID,...,Promotion_Flag,week_flag,first_purchase_flag,latest_purchase_flag,PRODUCT_ID,PRODUCT_CODE,merchant_name_eng,cost_price,new_category,TimePeriod
576811,129969831,107433405,1,47487,2013-03-31,13.89,4.63,3,4.9,999999999,...,No Promo,weekend,0,1,47487,474873,Delhi,3.260400,Kitchen_Clean,P2
576812,73776523,107378505,1,2026011,2013-03-31,13.65,15.60,1,18.5,999999999,...,No Promo,weekend,0,1,2026011,20260111,Delhi,15.296556,Food,P2
576813,73776523,107378505,1,985096,2013-03-31,16.90,3.38,5,5.2,999999999,...,No Promo,weekend,0,1,985096,9850968,Delhi,4.000000,Food,P2
576814,73776523,107378507,1,1010102,2013-03-31,28.50,28.50,1,28.5,999999999,...,No Promo,weekend,0,1,1010102,10101027,Delhi,18.000000,Drinks,P2
576815,6843775,107432203,1,6045246,2013-03-31,59.00,59.00,1,59.0,999999999,...,No Promo,weekend,0,1,6045246,60452462,Delhi,48.000000,Mobiles,P2

In [412]:
# Creating aggregated Tables

In [413]:
# No_baskets --- Count of Distinct Orderdates - Customer_ID

In [414]:
# Methods - for grouping /aggregation --

In [415]:
trans_dedup.columns

Index(['Customer_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt', 'Promotion_Flag', 'week_flag',
       'first_purchase_flag', 'latest_purchase_flag'],
      dtype='object')

In [416]:
trans_master.loc[trans_master['Customer_ID'] == 347, 'order_time'].value_counts()

order_time
2012-09-05    15
2012-11-01     4
2013-03-28     2
Name: count, dtype: int64

In [417]:
no_baskets = trans_master.groupby(['Customer_ID']).agg(no_baskets =\
                                         ( 'order_time', 'nunique')).add_prefix("tot_").reset_index()

In [418]:
# Revenue information for each customerid

In [419]:
trans_master.columns

Index(['Customer_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt', 'Promotion_Flag', 'week_flag',
       'first_purchase_flag', 'latest_purchase_flag', 'PRODUCT_ID',
       'PRODUCT_CODE', 'merchant_name_eng', 'cost_price', 'new_category',
       'TimePeriod'],
      dtype='object')

In [420]:
tot_sale_amt = trans_master.groupby(['Customer_ID']).agg(tot_sale_amt = ('sale_amount','sum')).reset_index()

In [421]:
trans_master.head()

,Customer_ID,order_id,merchant_id,product_id,order_time,sale_amount,sale_price,sale_number,web_portal_price,ACTIVITY_ID,...,Promotion_Flag,week_flag,first_purchase_flag,latest_purchase_flag,PRODUCT_ID,PRODUCT_CODE,merchant_name_eng,cost_price,new_category,TimePeriod
0,74062770,42100394,1,1166338,2012-04-01,12.0,6.0,2,6.0,999999999,...,No Promo,weekend,1,0,1166338,11663380,Delhi,5.20,Food,P1
1,50096376,42101420,1,966234,2012-04-01,14.0,14.0,1,14.0,999999999,...,No Promo,weekend,1,0,966234,9662344,Delhi,12.00,Food,P1
2,9612320,42138710,1,1110030,2012-04-01,18.0,18.0,1,22.0,999999999,...,No Promo,weekend,1,0,1110030,11100304,Delhi,17.50,Food,P1
3,633411,42150617,1,1858194,2012-04-01,1.5,1.5,1,1.5,999999999,...,No Promo,weekend,1,0,1858194,18581947,Delhi,1.35,Food,P1
4,91060281,42114460,1,9336,2012-04-01,2.6,2.6,1,2.6,999999999,...,No Promo,weekend,1,0,9336,93367,Delhi,2.38,Kitchen_Clean,P1

In [422]:
# Create two columns that have sales_amt by period

# sale_p1 - TotalSalesAmt
# sale_p2 - TotalSalesAmt

In [423]:
# Filter for P1 on trans_maste

In [424]:
p1  = trans_master.loc[trans_master['TimePeriod'] == "P1"]
p2  = trans_master.loc[trans_master['TimePeriod'] == "P2"]

In [425]:
p1

,Customer_ID,order_id,merchant_id,product_id,order_time,sale_amount,sale_price,sale_number,web_portal_price,ACTIVITY_ID,...,Promotion_Flag,week_flag,first_purchase_flag,latest_purchase_flag,PRODUCT_ID,PRODUCT_CODE,merchant_name_eng,cost_price,new_category,TimePeriod
0,74062770,42100394,1,1166338,2012-04-01,12.0,6.0,2,6.0,999999999,...,No Promo,weekend,1,0,1166338,11663380,Delhi,5.200,Food,P1
1,50096376,42101420,1,966234,2012-04-01,14.0,14.0,1,14.0,999999999,...,No Promo,weekend,1,0,966234,9662344,Delhi,12.000,Food,P1
2,9612320,42138710,1,1110030,2012-04-01,18.0,18.0,1,22.0,999999999,...,No Promo,weekend,1,0,1110030,11100304,Delhi,17.500,Food,P1
3,633411,42150617,1,1858194,2012-04-01,1.5,1.5,1,1.5,999999999,...,No Promo,weekend,1,0,1858194,18581947,Delhi,1.350,Food,P1
4,91060281,42114460,1,9336,2012-04-01,2.6,2.6,1,2.6,999999999,...,No Promo,weekend,1,0,9336,93367,Delhi,2.380,Kitchen_Clean,P1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
258766,5083580,78526327,1,33846,2012-09-30,73.9,73.9,1,75.9,999999999,...,No Promo,weekend,0,0,33846,338465,Delhi,67.000,Food,P1
259015,116158017,78528792,1,1973,2012-09-30,96.0,48.0,2,48.0,999999999,...,No Promo,weekend,0,0,1973,19738,Delhi,36.000,Beauty,P1
259020,116158017,78528792,1,2826,2012-09-30,4.8,1.6,3,1.6,999999999,...,No Promo,weekend,0,0,2826,28262,Delhi,1.148,Food,P1
263804,122500015,78395915,1,10224,2012-09-29,52.7,3.1,17,3.1,999999999,...,No Promo,weekday,0,0,10224,102249,Delhi,3.230,Beauty,P1
263805,122500015,78395915,1,2965,2012-09-29,155.6,77.8,2,77.8,999999999,...,No Promo,weekday,0,0,2965,29652,Delhi,68.000,Imported_Food,P1

In [426]:
p1.columns

Index(['Customer_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt', 'Promotion_Flag', 'week_flag',
       'first_purchase_flag', 'latest_purchase_flag', 'PRODUCT_ID',
       'PRODUCT_CODE', 'merchant_name_eng', 'cost_price', 'new_category',
       'TimePeriod'],
      dtype='object')

In [427]:
p1_sale_amt = p1.groupby(['Customer_ID']).agg(tot_sale_amt_p1 = ('sale_amount', 'sum')).reset_index()

In [428]:
p2_sale_amt = p2.groupby(['Customer_ID']).agg(tot_sale_amt_p2 = ('sale_amount', 'sum')).reset_index()

In [429]:
p1_sale_amt.head()

   Customer_ID  tot_sale_amt_p1
0          347           103.40
1          585        145041.30
2          885          1561.38
3         1670          2357.80
4         3934           205.60

In [430]:
p2_sale_amt.head()

   Customer_ID  tot_sale_amt_p2
0          347           230.80
1          885           723.21
2         1670          5734.37
3         4448           153.98
4         4468           413.80

In [431]:
trans_master.columns

Index(['Customer_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt', 'Promotion_Flag', 'week_flag',
       'first_purchase_flag', 'latest_purchase_flag', 'PRODUCT_ID',
       'PRODUCT_CODE', 'merchant_name_eng', 'cost_price', 'new_category',
       'TimePeriod'],
      dtype='object')

In [432]:
# cost_amt
# margin

# This should have been done immediately after merging - Done
trans_master['cost_amt'] = trans_master['sale_number']*trans_master['cost_price']
trans_master['margin'] = trans_master['sale_amount']- trans_master['cost_amt']

In [433]:
trans_master.head()

,Customer_ID,order_id,merchant_id,product_id,order_time,sale_amount,sale_price,sale_number,web_portal_price,ACTIVITY_ID,...,first_purchase_flag,latest_purchase_flag,PRODUCT_ID,PRODUCT_CODE,merchant_name_eng,cost_price,new_category,TimePeriod,cost_amt,margin
0,74062770,42100394,1,1166338,2012-04-01,12.0,6.0,2,6.0,999999999,...,1,0,1166338,11663380,Delhi,5.20,Food,P1,10.40,1.60
1,50096376,42101420,1,966234,2012-04-01,14.0,14.0,1,14.0,999999999,...,1,0,966234,9662344,Delhi,12.00,Food,P1,12.00,2.00
2,9612320,42138710,1,1110030,2012-04-01,18.0,18.0,1,22.0,999999999,...,1,0,1110030,11100304,Delhi,17.50,Food,P1,17.50,0.50
3,633411,42150617,1,1858194,2012-04-01,1.5,1.5,1,1.5,999999999,...,1,0,1858194,18581947,Delhi,1.35,Food,P1,1.35,0.15
4,91060281,42114460,1,9336,2012-04-01,2.6,2.6,1,2.6,999999999,...,1,0,9336,93367,Delhi,2.38,Kitchen_Clean,P1,2.38,0.22

In [434]:
# no_baskets_weekend

# create an aggregated column at level of customerid showing number of baskets over weekend

In [435]:
trans_master.columns

Index(['Customer_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt', 'Promotion_Flag', 'week_flag',
       'first_purchase_flag', 'latest_purchase_flag', 'PRODUCT_ID',
       'PRODUCT_CODE', 'merchant_name_eng', 'cost_price', 'new_category',
       'TimePeriod', 'cost_amt', 'margin'],
      dtype='object')

In [436]:
weekend_trans =  trans_master.loc[trans_master['week_flag'] == "weekend"]

In [437]:
weekend_trans.columns

Index(['Customer_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt', 'Promotion_Flag', 'week_flag',
       'first_purchase_flag', 'latest_purchase_flag', 'PRODUCT_ID',
       'PRODUCT_CODE', 'merchant_name_eng', 'cost_price', 'new_category',
       'TimePeriod', 'cost_amt', 'margin'],
      dtype='object')

In [438]:
weekend_baskets = weekend_trans.groupby(['Customer_ID']).agg(no_baskets_weekend = \
                                                             ('order_time','nunique')).reset_index()

In [439]:
#no_baskets_w_promo_prds

In [440]:
# Definition : Aggreged at the level of customerid, find number of basket which has promotion

In [441]:
trans_master.columns

Index(['Customer_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt', 'Promotion_Flag', 'week_flag',
       'first_purchase_flag', 'latest_purchase_flag', 'PRODUCT_ID',
       'PRODUCT_CODE', 'merchant_name_eng', 'cost_price', 'new_category',
       'TimePeriod', 'cost_amt', 'margin'],
      dtype='object')

In [442]:
trans_master['Promotion_Flag'].unique()

array(['No Promo', 'Promo'], dtype=object)

In [443]:
trans_promo = trans_master.loc[trans_master['Promotion_Flag'] == "Promo"]

In [444]:
baskets_prom = trans_promo.groupby(['Customer_ID']).agg(no_baskets_w_promo_prds = \
                                                             ('order_time','nunique')).reset_index()

In [445]:
#quantity

In [446]:
trans_master.head()

,Customer_ID,order_id,merchant_id,product_id,order_time,sale_amount,sale_price,sale_number,web_portal_price,ACTIVITY_ID,...,first_purchase_flag,latest_purchase_flag,PRODUCT_ID,PRODUCT_CODE,merchant_name_eng,cost_price,new_category,TimePeriod,cost_amt,margin
0,74062770,42100394,1,1166338,2012-04-01,12.0,6.0,2,6.0,999999999,...,1,0,1166338,11663380,Delhi,5.20,Food,P1,10.40,1.60
1,50096376,42101420,1,966234,2012-04-01,14.0,14.0,1,14.0,999999999,...,1,0,966234,9662344,Delhi,12.00,Food,P1,12.00,2.00
2,9612320,42138710,1,1110030,2012-04-01,18.0,18.0,1,22.0,999999999,...,1,0,1110030,11100304,Delhi,17.50,Food,P1,17.50,0.50
3,633411,42150617,1,1858194,2012-04-01,1.5,1.5,1,1.5,999999999,...,1,0,1858194,18581947,Delhi,1.35,Food,P1,1.35,0.15
4,91060281,42114460,1,9336,2012-04-01,2.6,2.6,1,2.6,999999999,...,1,0,9336,93367,Delhi,2.38,Kitchen_Clean,P1,2.38,0.22

In [447]:
# Aggregated at level of customerid, create sum of quantity

In [448]:
tot_quantity = trans_master.groupby(['Customer_ID']).agg(tot_quant = ('sale_number', 'sum')).reset_index()

In [449]:
# Aggregated at level of customerid, create sum of discount

In [450]:
trans_master.columns

Index(['Customer_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt', 'Promotion_Flag', 'week_flag',
       'first_purchase_flag', 'latest_purchase_flag', 'PRODUCT_ID',
       'PRODUCT_CODE', 'merchant_name_eng', 'cost_price', 'new_category',
       'TimePeriod', 'cost_amt', 'margin'],
      dtype='object')

In [451]:
tot_disc = trans_master.groupby(['Customer_ID']).agg(tot_disc = ('disc_amt', 'sum')).reset_index()

In [452]:
trans_master.columns

Index(['Customer_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt', 'Promotion_Flag', 'week_flag',
       'first_purchase_flag', 'latest_purchase_flag', 'PRODUCT_ID',
       'PRODUCT_CODE', 'merchant_name_eng', 'cost_price', 'new_category',
       'TimePeriod', 'cost_amt', 'margin'],
      dtype='object')

In [453]:
# discount_items - Aggregation at level of customerid, sum of sale number where there is discount

In [454]:
dis_trans = trans_master.loc[trans_master['disc_amt'] >0 ]

In [455]:
dis_items = dis_trans.groupby(['Customer_ID']).agg( discount_items = ('sale_number','sum')).reset_index()

In [456]:
# no_prods - Aggregation at level of customerid, number of PRODUCT_ID
no_prods = trans_master.groupby(['Customer_ID']).agg(no_prods = ('PRODUCT_ID','count')).reset_index()

In [457]:
#no_prds_weekend - # no_prods - Aggregation at level of customerid, number of PRODUCT_ID - weekend
#no_prds_promo - # no_prods - Aggregation at level of customerid, number of PRODUCT_ID - Promo

In [458]:
no_prods_weekend = weekend_trans.groupby(['Customer_ID']).agg(no_prds_weekend = \
                                                              ('PRODUCT_ID','count')).reset_index()

In [459]:
no_prds_promo = trans_promo.groupby(['Customer_ID']).agg(no_prds_promo = \
                                                              ('PRODUCT_ID','count')).reset_index()

In [460]:
# cat_prd_cnt_Food
# Group at level of CustomerID and catergory

In [461]:
trans_master.columns

Index(['Customer_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt', 'Promotion_Flag', 'week_flag',
       'first_purchase_flag', 'latest_purchase_flag', 'PRODUCT_ID',
       'PRODUCT_CODE', 'merchant_name_eng', 'cost_price', 'new_category',
       'TimePeriod', 'cost_amt', 'margin'],
      dtype='object')

In [462]:
cat_prod_cnt = trans_master.groupby(['Customer_ID','new_category']).agg(tot_prod_cnt =\
                                                                        ('PRODUCT_ID', 'count')).reset_index()

In [463]:
cat_prod_cnt.head()

   Customer_ID   new_category  tot_prod_cnt
0          347           Food            21
1          585         Beauty             1
2          585         Drinks             1
3          585  HH_Electrical             6
4          585           Home             2

In [464]:
cat_prod_cnt = cat_prod_cnt.pivot_table(index = 'Customer_ID',\
                         columns = 'new_category', values = 'tot_prod_cnt').reset_index()

In [465]:
cat_prod_cnt.columns

Index(['Customer_ID', 'Beauty', 'Car_prods', 'Digital', 'Drinks', 'Food',
       'HH_Electrical', 'Home', 'Imported_Food', 'Kitchen_Clean', 'Mobiles',
       'Mother_Child', 'Nutrition', 'Office_Computer', 'Others'],
      dtype='object', name='new_category')

In [466]:
new_cols = []
for i in cat_prod_cnt.columns:
    if i!= "Customer_ID":
        new_cols.append("cat_prd_cnt_"+ i)

In [467]:
["Customer_ID" ] + new_cols

['Customer_ID',
 'cat_prd_cnt_Beauty',
 'cat_prd_cnt_Car_prods',
 'cat_prd_cnt_Digital',
 'cat_prd_cnt_Drinks',
 'cat_prd_cnt_Food',
 'cat_prd_cnt_HH_Electrical',
 'cat_prd_cnt_Home',
 'cat_prd_cnt_Imported_Food',
 'cat_prd_cnt_Kitchen_Clean',
 'cat_prd_cnt_Mobiles',
 'cat_prd_cnt_Mother_Child',
 'cat_prd_cnt_Nutrition',
 'cat_prd_cnt_Office_Computer',
 'cat_prd_cnt_Others']

In [468]:
cat_prod_cnt.columns = ["Customer_ID" ] + new_cols

In [469]:
cat_prod_cnt.columns

Index(['Customer_ID', 'cat_prd_cnt_Beauty', 'cat_prd_cnt_Car_prods',
       'cat_prd_cnt_Digital', 'cat_prd_cnt_Drinks', 'cat_prd_cnt_Food',
       'cat_prd_cnt_HH_Electrical', 'cat_prd_cnt_Home',
       'cat_prd_cnt_Imported_Food', 'cat_prd_cnt_Kitchen_Clean',
       'cat_prd_cnt_Mobiles', 'cat_prd_cnt_Mother_Child',
       'cat_prd_cnt_Nutrition', 'cat_prd_cnt_Office_Computer',
       'cat_prd_cnt_Others'],
      dtype='object')

In [470]:
cat_prod_cnt.fillna(0, inplace = True)

In [471]:
cat_prod_cnt.head()

,Customer_ID,cat_prd_cnt_Beauty,cat_prd_cnt_Car_prods,cat_prd_cnt_Digital,cat_prd_cnt_Drinks,cat_prd_cnt_Food,cat_prd_cnt_HH_Electrical,cat_prd_cnt_Home,cat_prd_cnt_Imported_Food,cat_prd_cnt_Kitchen_Clean,cat_prd_cnt_Mobiles,cat_prd_cnt_Mother_Child,cat_prd_cnt_Nutrition,cat_prd_cnt_Office_Computer,cat_prd_cnt_Others
0,347,0.0,0.0,0.0,0.0,21.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,585,1.0,0.0,0.0,1.0,0.0,6.0,2.0,0.0,7.0,0.0,0.0,0.0,54.0,0.0
2,885,4.0,0.0,0.0,10.0,38.0,0.0,0.0,5.0,57.0,0.0,0.0,1.0,11.0,0.0
3,1670,48.0,0.0,0.0,17.0,66.0,0.0,2.0,69.0,73.0,0.0,1.0,0.0,0.0,0.0
4,3934,0.0,0.0,0.0,2.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [472]:
# cat_amt_Food
# Same rule as above but this time across categories take sum of sale amount

In [473]:
trans_master.head()

,Customer_ID,order_id,merchant_id,product_id,order_time,sale_amount,sale_price,sale_number,web_portal_price,ACTIVITY_ID,...,first_purchase_flag,latest_purchase_flag,PRODUCT_ID,PRODUCT_CODE,merchant_name_eng,cost_price,new_category,TimePeriod,cost_amt,margin
0,74062770,42100394,1,1166338,2012-04-01,12.0,6.0,2,6.0,999999999,...,1,0,1166338,11663380,Delhi,5.20,Food,P1,10.40,1.60
1,50096376,42101420,1,966234,2012-04-01,14.0,14.0,1,14.0,999999999,...,1,0,966234,9662344,Delhi,12.00,Food,P1,12.00,2.00
2,9612320,42138710,1,1110030,2012-04-01,18.0,18.0,1,22.0,999999999,...,1,0,1110030,11100304,Delhi,17.50,Food,P1,17.50,0.50
3,633411,42150617,1,1858194,2012-04-01,1.5,1.5,1,1.5,999999999,...,1,0,1858194,18581947,Delhi,1.35,Food,P1,1.35,0.15
4,91060281,42114460,1,9336,2012-04-01,2.6,2.6,1,2.6,999999999,...,1,0,9336,93367,Delhi,2.38,Kitchen_Clean,P1,2.38,0.22

In [474]:
cat_sum = trans_master.groupby(['Customer_ID','new_category']).agg(tot_cat_sale =\
                                                                        ('sale_amount', 'sum')).reset_index()

In [475]:
cat_sum

       Customer_ID   new_category  tot_cat_sale
0              347           Food        334.20
1              585         Beauty        630.00
2              585         Drinks        316.80
3              585  HH_Electrical       1417.70
4              585           Home         79.60
...            ...            ...           ...
77026    132473524           Food         23.70
77027    132484207  Imported_Food        101.86
77028    132489383  Imported_Food        169.00
77029    132490575      Nutrition         62.80
77030    132495965         Beauty         87.60

[77031 rows x 3 columns]

In [476]:
cat_sum = cat_sum.pivot_table(index = 'Customer_ID',\
                         columns = 'new_category', values = 'tot_cat_sale').reset_index()

In [477]:
cat_sum

new_category,Customer_ID,Beauty,Car_prods,Digital,Drinks,Food,HH_Electrical,Home,Imported_Food,Kitchen_Clean,Mobiles,Mother_Child,Nutrition,Office_Computer,Others
0,347,NaN,NaN,NaN,NaN,334.20,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,585,630.00,NaN,NaN,316.80,NaN,1417.7,79.60,NaN,6311.90,NaN,NaN,NaN,136285.30,NaN
2,885,29.70,NaN,NaN,372.14,303.00,NaN,NaN,65.90,1271.98,NaN,NaN,9.9,231.97,NaN
3,1670,1186.76,NaN,NaN,457.78,1584.85,NaN,82.75,2454.63,2305.50,NaN,19.9,NaN,NaN,NaN
4,3934,NaN,NaN,NaN,205.60,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
20323,132473524,NaN,NaN,NaN,85.20,23.70,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20324,132484207,NaN,NaN,NaN,NaN,NaN,NaN,NaN,101.86,NaN,NaN,NaN,NaN,NaN,NaN
20325,132489383,NaN,NaN,NaN,NaN,NaN,NaN,NaN,169.00,NaN,NaN,NaN,NaN,NaN,NaN
20326,132490575,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,62.8,NaN,NaN
20327,132495965,87.60,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [478]:
new_cols = []
for i in cat_sum.columns:
    if i!= "Customer_ID":
        new_cols.append("cat_amt_"+ i)

In [479]:
new_cols

['cat_amt_Beauty',
 'cat_amt_Car_prods',
 'cat_amt_Digital',
 'cat_amt_Drinks',
 'cat_amt_Food',
 'cat_amt_HH_Electrical',
 'cat_amt_Home',
 'cat_amt_Imported_Food',
 'cat_amt_Kitchen_Clean',
 'cat_amt_Mobiles',
 'cat_amt_Mother_Child',
 'cat_amt_Nutrition',
 'cat_amt_Office_Computer',
 'cat_amt_Others']

In [480]:
cat_sum.columns = ["Customer_ID" ] + new_cols

In [481]:
cat_sum.fillna(0, inplace = True)

In [482]:
cat_sum.head()

,Customer_ID,cat_amt_Beauty,cat_amt_Car_prods,cat_amt_Digital,cat_amt_Drinks,cat_amt_Food,cat_amt_HH_Electrical,cat_amt_Home,cat_amt_Imported_Food,cat_amt_Kitchen_Clean,cat_amt_Mobiles,cat_amt_Mother_Child,cat_amt_Nutrition,cat_amt_Office_Computer,cat_amt_Others
0,347,0.00,0.0,0.0,0.00,334.20,0.0,0.00,0.00,0.00,0.0,0.0,0.0,0.00,0.0
1,585,630.00,0.0,0.0,316.80,0.00,1417.7,79.60,0.00,6311.90,0.0,0.0,0.0,136285.30,0.0
2,885,29.70,0.0,0.0,372.14,303.00,0.0,0.00,65.90,1271.98,0.0,0.0,9.9,231.97,0.0
3,1670,1186.76,0.0,0.0,457.78,1584.85,0.0,82.75,2454.63,2305.50,0.0,19.9,0.0,0.00,0.0
4,3934,0.00,0.0,0.0,205.60,0.00,0.0,0.00,0.00,0.00,0.0,0.0,0.0,0.00,0.0

In [483]:
#cat_pen_Food

In [484]:
cat_prod_cnt.head()

,Customer_ID,cat_prd_cnt_Beauty,cat_prd_cnt_Car_prods,cat_prd_cnt_Digital,cat_prd_cnt_Drinks,cat_prd_cnt_Food,cat_prd_cnt_HH_Electrical,cat_prd_cnt_Home,cat_prd_cnt_Imported_Food,cat_prd_cnt_Kitchen_Clean,cat_prd_cnt_Mobiles,cat_prd_cnt_Mother_Child,cat_prd_cnt_Nutrition,cat_prd_cnt_Office_Computer,cat_prd_cnt_Others
0,347,0.0,0.0,0.0,0.0,21.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,585,1.0,0.0,0.0,1.0,0.0,6.0,2.0,0.0,7.0,0.0,0.0,0.0,54.0,0.0
2,885,4.0,0.0,0.0,10.0,38.0,0.0,0.0,5.0,57.0,0.0,0.0,1.0,11.0,0.0
3,1670,48.0,0.0,0.0,17.0,66.0,0.0,2.0,69.0,73.0,0.0,1.0,0.0,0.0,0.0
4,3934,0.0,0.0,0.0,2.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [485]:
cat_prod_cnt.loc[cat_prod_cnt['Customer_ID'] == 585].T

                                 1
Customer_ID                  585.0
cat_prd_cnt_Beauty             1.0
cat_prd_cnt_Car_prods          0.0
cat_prd_cnt_Digital            0.0
cat_prd_cnt_Drinks             1.0
cat_prd_cnt_Food               0.0
cat_prd_cnt_HH_Electrical      6.0
cat_prd_cnt_Home               2.0
cat_prd_cnt_Imported_Food      0.0
cat_prd_cnt_Kitchen_Clean      7.0
cat_prd_cnt_Mobiles            0.0
cat_prd_cnt_Mother_Child       0.0
cat_prd_cnt_Nutrition          0.0
cat_prd_cnt_Office_Computer   54.0
cat_prd_cnt_Others             0.0

In [486]:
# no_baskets by Customer_ID  - Dem
# no_baskets by Custoemr_ID, Category - Num

In [487]:
no_baskets.head()

   Customer_ID  tot_no_baskets
0          347               3
1          585               4
2          885               4
3         1670              28
4         3934               1

In [488]:
cat_bask_cnt = trans_master.groupby(['Customer_ID','new_category']).\
    agg(cat_bask_cont = ('order_time', 'nunique')).reset_index()

In [489]:
cat_pen = no_baskets.merge(cat_bask_cnt,left_on= ['Customer_ID'],
                 right_on = ['Customer_ID'], how = 'left')

In [490]:
cat_pen['penetration_value'] = cat_pen['cat_bask_cont']/cat_pen['tot_no_baskets']

In [491]:
cat_pen

,Customer_ID,tot_no_baskets,new_category,cat_bask_cont,penetration_value
0,347,3,Food,3,1.00
1,585,4,Beauty,1,0.25
2,585,4,Drinks,1,0.25
3,585,4,HH_Electrical,2,0.50
4,585,4,Home,2,0.50
...,...,...,...,...,...
77026,132473524,1,Food,1,1.00
77027,132484207,1,Imported_Food,1,1.00
77028,132489383,1,Imported_Food,1,1.00
77029,132490575,1,Nutrition,1,1.00
77030,132495965,1,Beauty,1,1.00

In [492]:
cat_pen = cat_pen.pivot_table(index = 'Customer_ID',\
                    columns = 'new_category', values = 'penetration_value').reset_index().fillna(0)

In [493]:
cat_pen

new_category,Customer_ID,Beauty,Car_prods,Digital,Drinks,Food,HH_Electrical,Home,Imported_Food,Kitchen_Clean,Mobiles,Mother_Child,Nutrition,Office_Computer,Others
0,347,0.000000,0.0,0.0,0.000000,1.000000,0.0,0.000000,0.000000,0.000000,0.0,0.000000,0.00,0.0,0.0
1,585,0.250000,0.0,0.0,0.250000,0.000000,0.5,0.500000,0.000000,0.750000,0.0,0.000000,0.00,0.5,0.0
2,885,0.500000,0.0,0.0,1.000000,0.750000,0.0,0.000000,0.500000,0.750000,0.0,0.000000,0.25,0.5,0.0
3,1670,0.678571,0.0,0.0,0.464286,0.892857,0.0,0.071429,0.928571,0.928571,0.0,0.035714,0.00,0.0,0.0
4,3934,0.000000,0.0,0.0,1.000000,0.000000,0.0,0.000000,0.000000,0.000000,0.0,0.000000,0.00,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
20323,132473524,0.000000,0.0,0.0,1.000000,1.000000,0.0,0.000000,0.000000,0.000000,0.0,0.000000,0.00,0.0,0.0
20324,132484207,0.000000,0.0,0.0,0.000000,0.000000,0.0,0.000000,1.000000,0.000000,0.0,0.000000,0.00,0.0,0.0
20325,132489383,0.000000,0.0,0.0,0.000000,0.000000,0.0,0.000000,1.000000,0.000000,0.0,0.000000,0.00,0.0,0.0
20326,132490575,0.000000,0.0,0.0,0.000000,0.000000,0.0,0.000000,0.000000,0.000000,0.0,0.000000,1.00,0.0,0.0
20327,132495965,1.000000,0.0,0.0,0.000000,0.000000,0.0,0.000000,0.000000,0.000000,0.0,0.000000,0.00,0.0,0.0

In [494]:
new_cols = []
for i in cat_pen.columns:
    if i!= "Customer_ID":
        new_cols.append("cat_pen_"+ i)

In [495]:
cat_pen.columns = ["Customer_ID"] + new_cols

In [496]:
cat_pen.head()

,Customer_ID,cat_pen_Beauty,cat_pen_Car_prods,cat_pen_Digital,cat_pen_Drinks,cat_pen_Food,cat_pen_HH_Electrical,cat_pen_Home,cat_pen_Imported_Food,cat_pen_Kitchen_Clean,cat_pen_Mobiles,cat_pen_Mother_Child,cat_pen_Nutrition,cat_pen_Office_Computer,cat_pen_Others
0,347,0.000000,0.0,0.0,0.000000,1.000000,0.0,0.000000,0.000000,0.000000,0.0,0.000000,0.00,0.0,0.0
1,585,0.250000,0.0,0.0,0.250000,0.000000,0.5,0.500000,0.000000,0.750000,0.0,0.000000,0.00,0.5,0.0
2,885,0.500000,0.0,0.0,1.000000,0.750000,0.0,0.000000,0.500000,0.750000,0.0,0.000000,0.25,0.5,0.0
3,1670,0.678571,0.0,0.0,0.464286,0.892857,0.0,0.071429,0.928571,0.928571,0.0,0.035714,0.00,0.0,0.0
4,3934,0.000000,0.0,0.0,1.000000,0.000000,0.0,0.000000,0.000000,0.000000,0.0,0.000000,0.00,0.0,0.0

In [497]:
#cat_pur_Food

In [498]:
cat_pen.head()

,Customer_ID,cat_pen_Beauty,cat_pen_Car_prods,cat_pen_Digital,cat_pen_Drinks,cat_pen_Food,cat_pen_HH_Electrical,cat_pen_Home,cat_pen_Imported_Food,cat_pen_Kitchen_Clean,cat_pen_Mobiles,cat_pen_Mother_Child,cat_pen_Nutrition,cat_pen_Office_Computer,cat_pen_Others
0,347,0.000000,0.0,0.0,0.000000,1.000000,0.0,0.000000,0.000000,0.000000,0.0,0.000000,0.00,0.0,0.0
1,585,0.250000,0.0,0.0,0.250000,0.000000,0.5,0.500000,0.000000,0.750000,0.0,0.000000,0.00,0.5,0.0
2,885,0.500000,0.0,0.0,1.000000,0.750000,0.0,0.000000,0.500000,0.750000,0.0,0.000000,0.25,0.5,0.0
3,1670,0.678571,0.0,0.0,0.464286,0.892857,0.0,0.071429,0.928571,0.928571,0.0,0.035714,0.00,0.0,0.0
4,3934,0.000000,0.0,0.0,1.000000,0.000000,0.0,0.000000,0.000000,0.000000,0.0,0.000000,0.00,0.0,0.0

In [499]:
# But still you can use cate_pen for flagging

In [500]:
#cat_pur_Food
# Create Category wise flags ,0 if no purchase in that category, 1 - if there is atleast one purchase

In [501]:
cat_pur = trans_master.groupby(['Customer_ID','new_category'])\
    .agg(tot_count = ('new_category','count')).reset_index()

In [502]:
cat_pur.head()

   Customer_ID   new_category  tot_count
0          347           Food         21
1          585         Beauty          1
2          585         Drinks          1
3          585  HH_Electrical          6
4          585           Home          2

In [503]:
cat_pur = cat_pur.pivot_table(index = 'Customer_ID',
                              columns = 'new_category', values = 'tot_count').reset_index().fillna(0)

In [504]:
cat_pur

new_category,Customer_ID,Beauty,Car_prods,Digital,Drinks,Food,HH_Electrical,Home,Imported_Food,Kitchen_Clean,Mobiles,Mother_Child,Nutrition,Office_Computer,Others
0,347,0.0,0.0,0.0,0.0,21.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,585,1.0,0.0,0.0,1.0,0.0,6.0,2.0,0.0,7.0,0.0,0.0,0.0,54.0,0.0
2,885,4.0,0.0,0.0,10.0,38.0,0.0,0.0,5.0,57.0,0.0,0.0,1.0,11.0,0.0
3,1670,48.0,0.0,0.0,17.0,66.0,0.0,2.0,69.0,73.0,0.0,1.0,0.0,0.0,0.0
4,3934,0.0,0.0,0.0,2.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
20323,132473524,0.0,0.0,0.0,2.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
20324,132484207,0.0,0.0,0.0,0.0,0.0,0.0,0.0,2.0,0.0,0.0,0.0,0.0,0.0,0.0
20325,132489383,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0
20326,132490575,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,3.0,0.0,0.0
20327,132495965,4.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [505]:
new_cols = []
for i in cat_pur.columns:
    if i!= "Customer_ID":
        new_cols.append("cat_pur_"+ i)

In [506]:
new_cols

['cat_pur_Beauty',
 'cat_pur_Car_prods',
 'cat_pur_Digital',
 'cat_pur_Drinks',
 'cat_pur_Food',
 'cat_pur_HH_Electrical',
 'cat_pur_Home',
 'cat_pur_Imported_Food',
 'cat_pur_Kitchen_Clean',
 'cat_pur_Mobiles',
 'cat_pur_Mother_Child',
 'cat_pur_Nutrition',
 'cat_pur_Office_Computer',
 'cat_pur_Others']

In [513]:
cat_pur.columns = ["Customer_ID"] + new_cols

In [514]:
cat_pur.head()

,Customer_ID,cat_pur_Beauty,cat_pur_Car_prods,cat_pur_Digital,cat_pur_Drinks,cat_pur_Food,cat_pur_HH_Electrical,cat_pur_Home,cat_pur_Imported_Food,cat_pur_Kitchen_Clean,cat_pur_Mobiles,cat_pur_Mother_Child,cat_pur_Nutrition,cat_pur_Office_Computer,cat_pur_Others
0,347,0.0,0.0,0.0,0.0,21.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,585,1.0,0.0,0.0,1.0,0.0,6.0,2.0,0.0,7.0,0.0,0.0,0.0,54.0,0.0
2,885,4.0,0.0,0.0,10.0,38.0,0.0,0.0,5.0,57.0,0.0,0.0,1.0,11.0,0.0
3,1670,48.0,0.0,0.0,17.0,66.0,0.0,2.0,69.0,73.0,0.0,1.0,0.0,0.0,0.0
4,3934,0.0,0.0,0.0,2.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [515]:
cat_pur.columns

Index(['Customer_ID', 'cat_pur_Beauty', 'cat_pur_Car_prods', 'cat_pur_Digital',
       'cat_pur_Drinks', 'cat_pur_Food', 'cat_pur_HH_Electrical',
       'cat_pur_Home', 'cat_pur_Imported_Food', 'cat_pur_Kitchen_Clean',
       'cat_pur_Mobiles', 'cat_pur_Mother_Child', 'cat_pur_Nutrition',
       'cat_pur_Office_Computer', 'cat_pur_Others'],
      dtype='object')

In [516]:
#pd.concat?

In [517]:
cat_pur = pd.concat([cat_pur['Customer_ID'],cat_pur[new_cols].applymap(lambda x : 1 if x > 0 else 0)],axis = 1)

C:\Users\ravul\AppData\Local\Temp\ipykernel_16356\356073966.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  cat_pur = pd.concat([cat_pur['Customer_ID'],cat_pur[new_cols].applymap(lambda x : 1 if x > 0 else 0)],axis = 1)

In [518]:
cat_pur.head()

,Customer_ID,cat_pur_Beauty,cat_pur_Car_prods,cat_pur_Digital,cat_pur_Drinks,cat_pur_Food,cat_pur_HH_Electrical,cat_pur_Home,cat_pur_Imported_Food,cat_pur_Kitchen_Clean,cat_pur_Mobiles,cat_pur_Mother_Child,cat_pur_Nutrition,cat_pur_Office_Computer,cat_pur_Others
0,347,0,0,0,0,1,0,0,0,0,0,0,0,0,0
1,585,1,0,0,1,0,1,1,0,1,0,0,0,1,0
2,885,1,0,0,1,1,0,0,1,1,0,0,1,1,0
3,1670,1,0,0,1,1,0,1,1,1,0,1,0,0,0
4,3934,0,0,0,1,0,0,0,0,0,0,0,0,0,0

In [519]:
trans_master.columns

Index(['Customer_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt', 'Promotion_Flag', 'week_flag',
       'first_purchase_flag', 'latest_purchase_flag', 'PRODUCT_ID',
       'PRODUCT_CODE', 'merchant_name_eng', 'cost_price', 'new_category',
       'TimePeriod', 'cost_amt', 'margin'],
      dtype='object')

In [543]:
first_trans = trans_master.loc[trans_master['first_purchase_flag'] == 1]

In [544]:
first_trans

,Customer_ID,order_id,merchant_id,product_id,order_time,sale_amount,sale_price,sale_number,web_portal_price,ACTIVITY_ID,...,first_purchase_flag,latest_purchase_flag,PRODUCT_ID,PRODUCT_CODE,merchant_name_eng,cost_price,new_category,TimePeriod,cost_amt,margin
0,74062770,42100394,1,1166338,2012-04-01,12.0,6.0,2,6.0,999999999,...,1,0,1166338,11663380,Delhi,5.200000,Food,P1,10.400000,1.600000
1,50096376,42101420,1,966234,2012-04-01,14.0,14.0,1,14.0,999999999,...,1,0,966234,9662344,Delhi,12.000000,Food,P1,12.000000,2.000000
2,9612320,42138710,1,1110030,2012-04-01,18.0,18.0,1,22.0,999999999,...,1,0,1110030,11100304,Delhi,17.500000,Food,P1,17.500000,0.500000
3,633411,42150617,1,1858194,2012-04-01,1.5,1.5,1,1.5,999999999,...,1,0,1858194,18581947,Delhi,1.350000,Food,P1,1.350000,0.150000
4,91060281,42114460,1,9336,2012-04-01,2.6,2.6,1,2.6,999999999,...,1,0,9336,93367,Delhi,2.380000,Kitchen_Clean,P1,2.380000,0.220000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3595,42806008,42109722,1,46927,2012-04-01,3.3,3.3,1,3.3,999999999,...,1,0,46927,469272,Delhi,2.668115,Food,P1,2.668115,0.631885
3597,42806008,42109722,1,3118,2012-04-01,8.9,8.9,1,9.9,999999999,...,1,0,3118,31185,Delhi,7.720000,Food,P1,7.720000,1.180000
3598,42806008,42109722,1,3119,2012-04-01,8.9,8.9,1,9.9,999999999,...,1,0,3119,31196,Delhi,7.720000,Food,P1,7.720000,1.180000
3599,42806008,42109722,1,999628,2012-04-01,12.5,2.5,5,3.5,999999999,...,1,0,999628,9996285,Delhi,2.500000,Drinks,P1,12.500000,0.000000
3618,6759883,42153293,1,1628,2012-04-01,50.9,50.9,1,89.0,999999999,...,1,0,1628,16284,Delhi,45.760000,Home,P1,45.760000,5.140000

In [545]:
first_trans = first_trans.groupby(['Customer_ID','new_category']).agg(tot_count = ('new_category', 'count')).reset_index()

In [546]:
first_trans.head()

   Customer_ID  new_category  tot_count
0        10588  Mother_Child          4
1        11868        Drinks          2
2        69570        Beauty          1
3        69570        Drinks          1
4        69570          Food          2

In [547]:
first_trans = first_trans.pivot_table(index = 'Customer_ID',\
                        columns = 'new_category', values = 'tot_count').reset_index().fillna(0)

In [548]:
new_cols = []
for i in first_trans.columns:
    if i!= "Customer_ID":
        new_cols.append("cat_first_"+ i)

In [549]:
new_cols

['cat_first_Beauty',
 'cat_first_Digital',
 'cat_first_Drinks',
 'cat_first_Food',
 'cat_first_HH_Electrical',
 'cat_first_Home',
 'cat_first_Imported_Food',
 'cat_first_Kitchen_Clean',
 'cat_first_Mobiles',
 'cat_first_Mother_Child',
 'cat_first_Nutrition',
 'cat_first_Office_Computer']

In [550]:
first_trans.columns = ["Customer_ID"] + new_cols

In [551]:
first_trans = pd.concat([first_trans['Customer_ID'],first_trans[new_cols].map(lambda x: 1 if x > 0 else 0)], axis = 1)

In [552]:
first_trans.head()

,Customer_ID,cat_first_Beauty,cat_first_Digital,cat_first_Drinks,cat_first_Food,cat_first_HH_Electrical,cat_first_Home,cat_first_Imported_Food,cat_first_Kitchen_Clean,cat_first_Mobiles,cat_first_Mother_Child,cat_first_Nutrition,cat_first_Office_Computer
0,10588,0,0,0,0,0,0,0,0,0,1,0,0
1,11868,0,0,1,0,0,0,0,0,0,0,0,0
2,69570,1,0,1,1,0,0,1,0,0,1,0,0
3,82939,1,0,1,0,0,1,0,0,0,0,0,0
4,138079,0,0,1,0,0,0,1,1,0,0,0,0

In [529]:
#No_Distinct_categories
# At CustomerID level number of unique categories calculated

In [561]:
no_distnt_cat =trans_master.groupby(['Customer_ID']).agg(No_Distinct_categories = ('new_category','nunique')).reset_index()

In [562]:
no_distnt_cat.head()

   Customer_ID  No_Distinct_categories
0          347                       1
1          585                       6
2          885                       7
3         1670                       7
4         3934                       1

In [563]:
no_distnt_cat

       Customer_ID  No_Distinct_categories
0              347                       1
1              585                       6
2              885                       7
3             1670                       7
4             3934                       1
...            ...                     ...
20323    132473524                       2
20324    132484207                       1
20325    132489383                       1
20326    132490575                       1
20327    132495965                       1

[20328 rows x 2 columns]

In [554]:
first_trans_df = trans_master.loc[trans_master['first_purchase_flag'] == 1]

In [559]:
# cat_cnt_first_purchase - first purchase flag == 1 and then count unique categories
no_distnt_cat_first =first_trans_df.groupby(['Customer_ID']).agg(cat_cnt_first_purchase = ('new_category','nunique')).reset_index()

In [560]:
no_distnt_cat

       Customer_ID  No_Distinct_categories
0              347                       1
1              585                       6
2              885                       7
3             1670                       7
4             3934                       1
...            ...                     ...
20323    132473524                       2
20324    132484207                       1
20325    132489383                       1
20326    132490575                       1
20327    132495965                       1

[20328 rows x 2 columns]

In [536]:
#no_distnt_cat

In [537]:
# Start merging the aggregated tables that were created

In [538]:
# Merge it customer table

In [539]:
cust.Customer_ID.value_counts()

Customer_ID
85498466     1
120895926    1
132418734    1
117298540    1
131633962    1
            ..
130318699    1
50285015     1
5050134      1
129716918    1
132490575    1
Name: count, Length: 22598, dtype: int64

In [ ]:
# Time to consolidate all aggregated tables
no_baskets
weekend_baskets
baskets_prom
tot_quantity
tot_disc
dis_items
no_prods
no_prods_weekend
no_prds_promo
cat_prod_cnt
cat_sum
cat_pen
cat_pur
first_trans
no_distnt_cat
no_distnt_cat_first
p1_sale_amt
p2_sale_amt

In [579]:
# Quick quality
no_distnt_cat_first.head()

   Customer_ID  cat_cnt_first_purchase
0        10588                       1
1        11868                       1
2        69570                       5
3        82939                       3
4       138079                       3

In [ ]:
tot_margin = trans_master.groupby(['Customer_ID']).agg(tot_mar = ('margin','sum')).reset_index()

In [580]:
# Common key --- b.w these tables --- 

# Customer_ID

In [ ]:
# df.merge

In [581]:
cust.columns

Index(['Customer_ID', 'Gender', 'first_Date', 'recent_date', 'Customer_value',
       'buy_times', 'Points_earned', 'Points_redeemed'],
      dtype='object')

In [582]:
no_baskets.head()

   Customer_ID  tot_no_baskets
0          347               3
1          585               4
2          885               4
3         1670              28
4         3934               1

In [603]:
tot_sale_amt

       Customer_ID  tot_sale_amt
0              347        334.20
1              585     145041.30
2              885       2284.59
3             1670       8092.17
4             3934        205.60
...            ...           ...
20323    132473524        108.90
20324    132484207        101.86
20325    132489383        169.00
20326    132490575         62.80
20327    132495965         87.60

[20328 rows x 2 columns]

In [685]:
trans_master.columns

Index(['Customer_ID', 'order_id', 'merchant_id', 'product_id', 'order_time',
       'sale_amount', 'sale_price', 'sale_number', 'web_portal_price',
       'ACTIVITY_ID', 'act_amt', 'disc_amt', 'Promotion_Flag', 'week_flag',
       'first_purchase_flag', 'latest_purchase_flag', 'PRODUCT_ID',
       'PRODUCT_CODE', 'merchant_name_eng', 'cost_price', 'new_category',
       'TimePeriod', 'cost_amt', 'margin'],
      dtype='object')

In [687]:
tot_act_amt = trans_master.groupby(['Customer_ID']).agg(tot_act_amt = ('act_amt','sum')).reset_index().fillna(0)

In [689]:
tot_act_amt.head(1)

   Customer_ID  tot_act_amt
0          347        360.9

In [ ]:
# Time to consolidate all aggregated tables
no_baskets -done
weekend_baskets -done
baskets_prom
tot_quantity
tot_disc
dis_items
no_prods
no_prods_weekend
no_prds_promo
cat_prod_cnt
cat_sum
cat_pen
cat_pur
first_trans
no_distnt_cat
no_distnt_cat_first
tot_act_amt
tot_sale_amt
p1_sale_amt
p2_sale_amt

In [801]:
master_table = cust.merge(no_baskets, left_on = "Customer_ID",
           right_on = "Customer_ID",
           how = "left").merge(weekend_baskets,left_on = "Customer_ID",right_on = "Customer_ID",
                               how = "left").merge(baskets_prom,left_on = "Customer_ID",right_on = "Customer_ID",
                                how = "left").merge(tot_quantity,left_on = "Customer_ID",right_on = "Customer_ID",
                                how = "left").merge(tot_sale_amt,left_on = "Customer_ID",right_on = "Customer_ID",
                                how = "left").merge(tot_disc,left_on = "Customer_ID",
                                right_on = "Customer_ID",how = "left").merge(dis_items,left_on = "Customer_ID",
                                right_on = "Customer_ID",how = "left").merge(no_prods,left_on = "Customer_ID",
                                right_on = "Customer_ID",how = "left").merge(no_prods_weekend,left_on = "Customer_ID",
                                right_on = "Customer_ID",how = "left").merge(no_prds_promo,left_on = "Customer_ID",
                                right_on = "Customer_ID",how = "left").merge(cat_prod_cnt,left_on = "Customer_ID",
                                right_on = "Customer_ID",how = "left").merge(cat_sum,left_on = "Customer_ID",
                                right_on = "Customer_ID",how = "left").merge(cat_pen,left_on = "Customer_ID",
                                right_on = "Customer_ID",how = "left").merge(cat_pur,left_on = "Customer_ID",
                                right_on = "Customer_ID",how = "left").merge(first_trans,left_on = "Customer_ID",
                                right_on = "Customer_ID",how = "left").merge(no_distnt_cat,left_on = "Customer_ID",
                                right_on = "Customer_ID",how = "left").merge(no_distnt_cat_first,left_on = "Customer_ID",
                                right_on = "Customer_ID",how = "left").merge(tot_margin,left_on = "Customer_ID",
                                right_on = "Customer_ID",how = "left").merge(tot_act_amt,left_on = "Customer_ID",
                                right_on = "Customer_ID",how = "left").merge(p1_sale_amt,left_on = "Customer_ID",
                                right_on = "Customer_ID",how = "left").merge(p2_sale_amt,left_on = "Customer_ID",
                                right_on = "Customer_ID",how = "left")

In [802]:
master_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22598 entries, 0 to 22597
Data columns (total 92 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Customer_ID                  22598 non-null  int64
 1   Gender                       22598 non-null  object
 2   first_Date                   22598 non-null  datetime64[ns]
 3   recent_date                  22598 non-null  datetime64[ns]
 4   Customer_value               22598 non-null  float64
 5   buy_times                    22598 non-null  int64
 6   Points_earned                22598 non-null  int64
 7   Points_redeemed              22598 non-null  float64
 8   tot_no_baskets               20327 non-null  float64
 9   no_baskets_weekend           7196 non-null   float64
 10  no_baskets_w_promo_prds      8360 non-null   float64
 11  tot_quant                    20327 non-null  float64
 12  tot_sale_amt                 20327 non-null  float64
 13  tot_disc                     20327 non-null  float64
 14  discount_items               19363 non-null  float64
 15  no_prods                     20327 non-null  float64
 16  no_prds_weekend              7196 non-null   float64
 17  no_prds_promo                8360 non-null   float64
 18  cat_prd_cnt_Beauty           20327 non-null  float64
 19  cat_prd_cnt_Car_prods        20327 non-null  float64
 20  cat_prd_cnt_Digital          20327 non-null  float64
 21  cat_prd_cnt_Drinks           20327 non-null  float64
 22  cat_prd_cnt_Food             20327 non-null  float64
 23  cat_prd_cnt_HH_Electrical    20327 non-null  float64
 24  cat_prd_cnt_Home             20327 non-null  float64
 25  cat_prd_cnt_Imported_Food    20327 non-null  float64
 26  cat_prd_cnt_Kitchen_Clean    20327 non-null  float64
 27  cat_prd_cnt_Mobiles          20327 non-null  float64
 28  cat_prd_cnt_Mother_Child     20327 non-null  float64
 29  cat_prd_cnt_Nutrition        20327 non-null  float64
 30  cat_prd_cnt_Office_Computer  20327 non-null  float64
 31  cat_prd_cnt_Others           20327 non-null  float64
 32  cat_amt_Beauty               20327 non-null  float64
 33  cat_amt_Car_prods            20327 non-null  float64
 34  cat_amt_Digital              20327 non-null  float64
 35  cat_amt_Drinks               20327 non-null  float64
 36  cat_amt_Food                 20327 non-null  float64
 37  cat_amt_HH_Electrical        20327 non-null  float64
 38  cat_amt_Home                 20327 non-null  float64
 39  cat_amt_Imported_Food        20327 non-null  float64
 40  cat_amt_Kitchen_Clean        20327 non-null  float64
 41  cat_amt_Mobiles              20327 non-null  float64
 42  cat_amt_Mother_Child         20327 non-null  float64
 43  cat_amt_Nutrition            20327 non-null  float64
 44  cat_amt_Office_Computer      20327 non-null  float64
 45  cat_amt_Others               20327 non-null  float64
 46  cat_pen_Beauty               20327 non-null  float64
 47  cat_pen_Car_prods            20327 non-null  float64
 48  cat_pen_Digital              20327 non-null  float64
 49  cat_pen_Drinks               20327 non-null  float64
 50  cat_pen_Food                 20327 non-null  float64
 51  cat_pen_HH_Electrical        20327 non-null  float64
 52  cat_pen_Home                 20327 non-null  float64
 53  cat_pen_Imported_Food        20327 non-null  float64
 54  cat_pen_Kitchen_Clean        20327 non-null  float64
 55  cat_pen_Mobiles              20327 non-null  float64
 56  cat_pen_Mother_Child         20327 non-null  float64
 57  cat_pen_Nutrition            20327 non-null  float64
 58  cat_pen_Office_Computer      20327 non-null  float64
 59  cat_pen_Others               20327 non-null  float64
 60  cat_pur_Beauty               20327 non-null  float64
 61  cat_pur_Car_prods            20327 non-null  float64
 62  cat_pur_Digital              20327 non-null  float64
 63  cat_pur_Drinks               20327 non-null  float64
 64  cat_pur_Food                 20327 non-null  float64
 65  cat_pur_HH_Electrical        20327 non-null  float64
 66  cat_pur_Home                 20327 non-null  float64
 67  cat_pur_Imported_Food        20327 non-null  float64
 68  cat_pur_Kitchen_Clean        20327 non-null  float64
 69  cat_pur_Mobiles              20327 non-null  float64
 70  cat_pur_Mother_Child         20327 non-null  float64
 71  cat_pur_Nutrition            20327 non-null  float64
 72  cat_pur_Office_Computer      20327 non-null  float64
 73  cat_pur_Others               20327 non-null  float64
 74  cat_first_Beauty             161 non-null    float64
 75  cat_first_Digital            161 non-null    float64
 76  cat_first_Drinks             161 non-null    float64
 77  cat_first_Food               161 non-null    float64
 78  cat_first_HH_Electrical      161 non-null    float64
 79  cat_first_Home               161 non-null    float64
 80  cat_first_Imported_Food      161 non-null    float64
 81  cat_first_Kitchen_Clean      161 non-null    float64
 82  cat_first_Mobiles            161 non-null    float64
 83  cat_first_Mother_Child       161 non-null    float64
 84  cat_first_Nutrition          161 non-null    float64
 85  cat_first_Office_Computer    161 non-null    float64
 86  No_Distinct_categories       20327 non-null  float64
 87  cat_cnt_first_purchase       161 non-null    float64
 88  tot_mar                      20327 non-null  float64
 89  tot_act_amt                  20327 non-null  float64
 90  tot_sale_amt_p1              12242 non-null  float64
 91  tot_sale_amt_p2              15542 non-null  float64
dtypes: datetime64[ns](2), float64(86), int64(3), object(1)
memory usage: 15.9+ MB

In [803]:
master_table.fillna(0, inplace = True)

In [804]:
master_table.columns[master_table.isnull().sum() > 0]

Index([], dtype='object')

In [805]:
master_table.head(2)

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed,tot_no_baskets,no_baskets_weekend,...,cat_first_Mobiles,cat_first_Mother_Child,cat_first_Nutrition,cat_first_Office_Computer,No_Distinct_categories,cat_cnt_first_purchase,tot_mar,tot_act_amt,tot_sale_amt_p1,tot_sale_amt_p2
0,85498466,M,2012-01-01,2012-01-01,15.9000,1,135,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.000000,0.0,0.00,0.00
1,14634939,M,2012-01-02,2013-02-27,4454.0996,35,2130,11.0,18.0,2.0,...,0.0,0.0,0.0,0.0,8.0,0.0,-70.290014,3371.6,1211.07,1612.85

In [806]:
#avg_basket_value

In [807]:
master_table.loc[master_table['Customer_ID'] == 14634939].columns

Index(['Customer_ID', 'Gender', 'first_Date', 'recent_date', 'Customer_value',
       'buy_times', 'Points_earned', 'Points_redeemed', 'tot_no_baskets',
       'no_baskets_weekend', 'no_baskets_w_promo_prds', 'tot_quant',
       'tot_sale_amt', 'tot_disc', 'discount_items', 'no_prods',
       'no_prds_weekend', 'no_prds_promo', 'cat_prd_cnt_Beauty',
       'cat_prd_cnt_Car_prods', 'cat_prd_cnt_Digital', 'cat_prd_cnt_Drinks',
       'cat_prd_cnt_Food', 'cat_prd_cnt_HH_Electrical', 'cat_prd_cnt_Home',
       'cat_prd_cnt_Imported_Food', 'cat_prd_cnt_Kitchen_Clean',
       'cat_prd_cnt_Mobiles', 'cat_prd_cnt_Mother_Child',
       'cat_prd_cnt_Nutrition', 'cat_prd_cnt_Office_Computer',
       'cat_prd_cnt_Others', 'cat_amt_Beauty', 'cat_amt_Car_prods',
       'cat_amt_Digital', 'cat_amt_Drinks', 'cat_amt_Food',
       'cat_amt_HH_Electrical', 'cat_amt_Home', 'cat_amt_Imported_Food',
       'cat_amt_Kitchen_Clean', 'cat_amt_Mobiles', 'cat_amt_Mother_Child',
       'cat_amt_Nutrition', 'cat_amt_Office_Computer', 'cat_amt_Others',
       'cat_pen_Beauty', 'cat_pen_Car_prods', 'cat_pen_Digital',
       'cat_pen_Drinks', 'cat_pen_Food', 'cat_pen_HH_Electrical',
       'cat_pen_Home', 'cat_pen_Imported_Food', 'cat_pen_Kitchen_Clean',
       'cat_pen_Mobiles', 'cat_pen_Mother_Child', 'cat_pen_Nutrition',
       'cat_pen_Office_Computer', 'cat_pen_Others', 'cat_pur_Beauty',
       'cat_pur_Car_prods', 'cat_pur_Digital', 'cat_pur_Drinks',
       'cat_pur_Food', 'cat_pur_HH_Electrical', 'cat_pur_Home',
       'cat_pur_Imported_Food', 'cat_pur_Kitchen_Clean', 'cat_pur_Mobiles',
       'cat_pur_Mother_Child', 'cat_pur_Nutrition', 'cat_pur_Office_Computer',
       'cat_pur_Others', 'cat_first_Beauty', 'cat_first_Digital',
       'cat_first_Drinks', 'cat_first_Food', 'cat_first_HH_Electrical',
       'cat_first_Home', 'cat_first_Imported_Food', 'cat_first_Kitchen_Clean',
       'cat_first_Mobiles', 'cat_first_Mother_Child', 'cat_first_Nutrition',
       'cat_first_Office_Computer', 'No_Distinct_categories',
       'cat_cnt_first_purchase', 'tot_mar', 'tot_act_amt', 'tot_sale_amt_p1',
       'tot_sale_amt_p2'],
      dtype='object')

In [808]:
master_table['avg_basket_value'] = master_table['tot_sale_amt']/master_table['tot_no_baskets']

In [809]:
master_table.head()

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed,tot_no_baskets,no_baskets_weekend,...,cat_first_Mother_Child,cat_first_Nutrition,cat_first_Office_Computer,No_Distinct_categories,cat_cnt_first_purchase,tot_mar,tot_act_amt,tot_sale_amt_p1,tot_sale_amt_p2,avg_basket_value
0,85498466,M,2012-01-01,2012-01-01,15.9000,1,135,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.000000,0.0,0.00,0.00,NaN
1,14634939,M,2012-01-02,2013-02-27,4454.0996,35,2130,11.0,18.0,2.0,...,0.0,0.0,0.0,8.0,0.0,-70.290014,3371.6,1211.07,1612.85,156.884444
2,14860694,F,2012-01-03,2013-02-19,2756.2800,19,987,785.0,13.0,2.0,...,0.0,0.0,0.0,5.0,0.0,44.889585,2767.5,1329.98,819.02,165.307692
3,85570763,M,2012-01-03,2012-04-06,902.3000,6,240,0.0,1.0,0.0,...,0.0,0.0,0.0,2.0,0.0,6.525750,108.7,103.50,0.00,103.500000
4,85796047,M,2012-01-06,2012-01-06,39.8000,1,40,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.000000,0.0,0.00,0.00,NaN

In [810]:
#avg_margin

In [811]:
# avg_margin = margin/no_baskets

In [812]:
master_table['avg_margin'] = master_table['tot_mar']/ master_table['tot_no_baskets']

In [813]:
master_table.head(1)

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed,tot_no_baskets,no_baskets_weekend,...,cat_first_Nutrition,cat_first_Office_Computer,No_Distinct_categories,cat_cnt_first_purchase,tot_mar,tot_act_amt,tot_sale_amt_p1,tot_sale_amt_p2,avg_basket_value,avg_margin
0,85498466,M,2012-01-01,2012-01-01,15.9,1,135,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN,NaN

In [814]:
# avg_quantiy

# sum(quantity)/no_baskets

In [815]:
master_table['avg_quant'] = master_table['tot_quant']/master_table['tot_no_baskets']

In [816]:
master_table.head(2)

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed,tot_no_baskets,no_baskets_weekend,...,cat_first_Office_Computer,No_Distinct_categories,cat_cnt_first_purchase,tot_mar,tot_act_amt,tot_sale_amt_p1,tot_sale_amt_p2,avg_basket_value,avg_margin,avg_quant
0,85498466,M,2012-01-01,2012-01-01,15.9000,1,135,0.0,0.0,0.0,...,0.0,0.0,0.0,0.000000,0.0,0.00,0.00,NaN,NaN,NaN
1,14634939,M,2012-01-02,2013-02-27,4454.0996,35,2130,11.0,18.0,2.0,...,0.0,8.0,0.0,-70.290014,3371.6,1211.07,1612.85,156.884444,-3.905001,8.777778

In [817]:
# avg_discount
# tot_discount/no_baskets

master_table['avg_disc'] = master_table['tot_disc']/master_table['tot_no_baskets']

In [818]:
master_table.head(2)

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed,tot_no_baskets,no_baskets_weekend,...,No_Distinct_categories,cat_cnt_first_purchase,tot_mar,tot_act_amt,tot_sale_amt_p1,tot_sale_amt_p2,avg_basket_value,avg_margin,avg_quant,avg_disc
0,85498466,M,2012-01-01,2012-01-01,15.9000,1,135,0.0,0.0,0.0,...,0.0,0.0,0.000000,0.0,0.00,0.00,NaN,NaN,NaN,NaN
1,14634939,M,2012-01-02,2013-02-27,4454.0996,35,2130,11.0,18.0,2.0,...,8.0,0.0,-70.290014,3371.6,1211.07,1612.85,156.884444,-3.905001,8.777778,30.426667

In [819]:
# avg_prods
# no_prods/ total_numberofbaskets

In [820]:
master_table['avg_prods'] = master_table['no_prods']/ master_table['tot_no_baskets']

In [821]:
master_table.head(2)

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed,tot_no_baskets,no_baskets_weekend,...,cat_cnt_first_purchase,tot_mar,tot_act_amt,tot_sale_amt_p1,tot_sale_amt_p2,avg_basket_value,avg_margin,avg_quant,avg_disc,avg_prods
0,85498466,M,2012-01-01,2012-01-01,15.9000,1,135,0.0,0.0,0.0,...,0.0,0.000000,0.0,0.00,0.00,NaN,NaN,NaN,NaN,NaN
1,14634939,M,2012-01-02,2013-02-27,4454.0996,35,2130,11.0,18.0,2.0,...,0.0,-70.290014,3371.6,1211.07,1612.85,156.884444,-3.905001,8.777778,30.426667,6.277778

In [822]:
# Additional_Flags

In [823]:
# buyer_flag

In [824]:
# if no_basket = 1, one time buyer, else Repeat buyer

In [825]:
master_table.fillna(0, inplace = True)

In [826]:
master_table.columns

Index(['Customer_ID', 'Gender', 'first_Date', 'recent_date', 'Customer_value',
       'buy_times', 'Points_earned', 'Points_redeemed', 'tot_no_baskets',
       'no_baskets_weekend', 'no_baskets_w_promo_prds', 'tot_quant',
       'tot_sale_amt', 'tot_disc', 'discount_items', 'no_prods',
       'no_prds_weekend', 'no_prds_promo', 'cat_prd_cnt_Beauty',
       'cat_prd_cnt_Car_prods', 'cat_prd_cnt_Digital', 'cat_prd_cnt_Drinks',
       'cat_prd_cnt_Food', 'cat_prd_cnt_HH_Electrical', 'cat_prd_cnt_Home',
       'cat_prd_cnt_Imported_Food', 'cat_prd_cnt_Kitchen_Clean',
       'cat_prd_cnt_Mobiles', 'cat_prd_cnt_Mother_Child',
       'cat_prd_cnt_Nutrition', 'cat_prd_cnt_Office_Computer',
       'cat_prd_cnt_Others', 'cat_amt_Beauty', 'cat_amt_Car_prods',
       'cat_amt_Digital', 'cat_amt_Drinks', 'cat_amt_Food',
       'cat_amt_HH_Electrical', 'cat_amt_Home', 'cat_amt_Imported_Food',
       'cat_amt_Kitchen_Clean', 'cat_amt_Mobiles', 'cat_amt_Mother_Child',
       'cat_amt_Nutrition', 'cat_amt_Office_Computer', 'cat_amt_Others',
       'cat_pen_Beauty', 'cat_pen_Car_prods', 'cat_pen_Digital',
       'cat_pen_Drinks', 'cat_pen_Food', 'cat_pen_HH_Electrical',
       'cat_pen_Home', 'cat_pen_Imported_Food', 'cat_pen_Kitchen_Clean',
       'cat_pen_Mobiles', 'cat_pen_Mother_Child', 'cat_pen_Nutrition',
       'cat_pen_Office_Computer', 'cat_pen_Others', 'cat_pur_Beauty',
       'cat_pur_Car_prods', 'cat_pur_Digital', 'cat_pur_Drinks',
       'cat_pur_Food', 'cat_pur_HH_Electrical', 'cat_pur_Home',
       'cat_pur_Imported_Food', 'cat_pur_Kitchen_Clean', 'cat_pur_Mobiles',
       'cat_pur_Mother_Child', 'cat_pur_Nutrition', 'cat_pur_Office_Computer',
       'cat_pur_Others', 'cat_first_Beauty', 'cat_first_Digital',
       'cat_first_Drinks', 'cat_first_Food', 'cat_first_HH_Electrical',
       'cat_first_Home', 'cat_first_Imported_Food', 'cat_first_Kitchen_Clean',
       'cat_first_Mobiles', 'cat_first_Mother_Child', 'cat_first_Nutrition',
       'cat_first_Office_Computer', 'No_Distinct_categories',
       'cat_cnt_first_purchase', 'tot_mar', 'tot_act_amt', 'tot_sale_amt_p1',
       'tot_sale_amt_p2', 'avg_basket_value', 'avg_margin', 'avg_quant',
       'avg_disc', 'avg_prods'],
      dtype='object')

In [827]:
master_table_active = master_table.loc[master_table['tot_no_baskets'] != 0,:]

In [828]:
np.where(master_table_active['tot_no_baskets'] == 1, "One Time Buyer", "Repeat")

array(['Repeat', 'Repeat', 'One Time Buyer', ..., 'One Time Buyer',
       'One Time Buyer', 'One Time Buyer'], dtype='<U14')

In [829]:
master_table_active['buyer_flag'] = np.where(master_table_active['tot_no_baskets'] == 1,\
                                             "One Time Buyer", "Repeat")

C:\Users\ravul\AppData\Local\Temp\ipykernel_16356\2500786459.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  master_table_active['buyer_flag'] = np.where(master_table_active['tot_no_baskets'] == 1,\

In [830]:
master_table_active.head()

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed,tot_no_baskets,no_baskets_weekend,...,tot_mar,tot_act_amt,tot_sale_amt_p1,tot_sale_amt_p2,avg_basket_value,avg_margin,avg_quant,avg_disc,avg_prods,buyer_flag
1,14634939,M,2012-01-02,2013-02-27,4454.099600,35,2130,11.0,18.0,2.0,...,-70.290014,3371.60,1211.07,1612.85,156.884444,-3.905001,8.777778,30.426667,6.277778,Repeat
2,14860694,F,2012-01-03,2013-02-19,2756.280000,19,987,785.0,13.0,2.0,...,44.889585,2767.50,1329.98,819.02,165.307692,3.453045,7.615385,47.576923,4.923077,Repeat
3,85570763,M,2012-01-03,2012-04-06,902.300000,6,240,0.0,1.0,0.0,...,6.525750,108.70,103.50,0.00,103.500000,6.525750,5.000000,5.200000,3.000000,One Time Buyer
5,85248563,F,2012-01-07,2013-02-03,1702.310000,6,645,0.0,4.0,2.0,...,-76.805848,1820.90,356.31,855.91,303.055000,-19.201462,7.500000,152.170000,3.250000,Repeat
6,85006060,M,2012-01-08,2013-03-31,3038.046572,23,288,2995.0,17.0,3.0,...,-66.621247,3527.18,909.72,1526.39,143.300588,-3.918897,18.823529,64.180588,7.647059,Repeat

In [831]:
# is_redeemed - 0(not redeemed),1(redeemed)

np.where(master_table_active['Points_redeemed'] > 0, 1, 0)

array([1, 1, 0, ..., 0, 0, 0])

In [832]:
master_table_active.loc[:,'redeem_flag'] = np.where(master_table_active['Points_redeemed'] > 0, 1, 0)

C:\Users\ravul\AppData\Local\Temp\ipykernel_16356\840903214.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  master_table_active.loc[:,'redeem_flag'] = np.where(master_table_active['Points_redeemed'] > 0, 1, 0)

In [833]:
master_table_active.head()

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed,tot_no_baskets,no_baskets_weekend,...,tot_act_amt,tot_sale_amt_p1,tot_sale_amt_p2,avg_basket_value,avg_margin,avg_quant,avg_disc,avg_prods,buyer_flag,redeem_flag
1,14634939,M,2012-01-02,2013-02-27,4454.099600,35,2130,11.0,18.0,2.0,...,3371.60,1211.07,1612.85,156.884444,-3.905001,8.777778,30.426667,6.277778,Repeat,1
2,14860694,F,2012-01-03,2013-02-19,2756.280000,19,987,785.0,13.0,2.0,...,2767.50,1329.98,819.02,165.307692,3.453045,7.615385,47.576923,4.923077,Repeat,1
3,85570763,M,2012-01-03,2012-04-06,902.300000,6,240,0.0,1.0,0.0,...,108.70,103.50,0.00,103.500000,6.525750,5.000000,5.200000,3.000000,One Time Buyer,0
5,85248563,F,2012-01-07,2013-02-03,1702.310000,6,645,0.0,4.0,2.0,...,1820.90,356.31,855.91,303.055000,-19.201462,7.500000,152.170000,3.250000,Repeat,0
6,85006060,M,2012-01-08,2013-03-31,3038.046572,23,288,2995.0,17.0,3.0,...,3527.18,909.72,1526.39,143.300588,-3.918897,18.823529,64.180588,7.647059,Repeat,1

In [834]:
#multi_cat_flag - if cat_cnt = 1, 0, else 1

In [835]:
master_table_active.columns

Index(['Customer_ID', 'Gender', 'first_Date', 'recent_date', 'Customer_value',
       'buy_times', 'Points_earned', 'Points_redeemed', 'tot_no_baskets',
       'no_baskets_weekend', 'no_baskets_w_promo_prds', 'tot_quant',
       'tot_sale_amt', 'tot_disc', 'discount_items', 'no_prods',
       'no_prds_weekend', 'no_prds_promo', 'cat_prd_cnt_Beauty',
       'cat_prd_cnt_Car_prods', 'cat_prd_cnt_Digital', 'cat_prd_cnt_Drinks',
       'cat_prd_cnt_Food', 'cat_prd_cnt_HH_Electrical', 'cat_prd_cnt_Home',
       'cat_prd_cnt_Imported_Food', 'cat_prd_cnt_Kitchen_Clean',
       'cat_prd_cnt_Mobiles', 'cat_prd_cnt_Mother_Child',
       'cat_prd_cnt_Nutrition', 'cat_prd_cnt_Office_Computer',
       'cat_prd_cnt_Others', 'cat_amt_Beauty', 'cat_amt_Car_prods',
       'cat_amt_Digital', 'cat_amt_Drinks', 'cat_amt_Food',
       'cat_amt_HH_Electrical', 'cat_amt_Home', 'cat_amt_Imported_Food',
       'cat_amt_Kitchen_Clean', 'cat_amt_Mobiles', 'cat_amt_Mother_Child',
       'cat_amt_Nutrition', 'cat_amt_Office_Computer', 'cat_amt_Others',
       'cat_pen_Beauty', 'cat_pen_Car_prods', 'cat_pen_Digital',
       'cat_pen_Drinks', 'cat_pen_Food', 'cat_pen_HH_Electrical',
       'cat_pen_Home', 'cat_pen_Imported_Food', 'cat_pen_Kitchen_Clean',
       'cat_pen_Mobiles', 'cat_pen_Mother_Child', 'cat_pen_Nutrition',
       'cat_pen_Office_Computer', 'cat_pen_Others', 'cat_pur_Beauty',
       'cat_pur_Car_prods', 'cat_pur_Digital', 'cat_pur_Drinks',
       'cat_pur_Food', 'cat_pur_HH_Electrical', 'cat_pur_Home',
       'cat_pur_Imported_Food', 'cat_pur_Kitchen_Clean', 'cat_pur_Mobiles',
       'cat_pur_Mother_Child', 'cat_pur_Nutrition', 'cat_pur_Office_Computer',
       'cat_pur_Others', 'cat_first_Beauty', 'cat_first_Digital',
       'cat_first_Drinks', 'cat_first_Food', 'cat_first_HH_Electrical',
       'cat_first_Home', 'cat_first_Imported_Food', 'cat_first_Kitchen_Clean',
       'cat_first_Mobiles', 'cat_first_Mother_Child', 'cat_first_Nutrition',
       'cat_first_Office_Computer', 'No_Distinct_categories',
       'cat_cnt_first_purchase', 'tot_mar', 'tot_act_amt', 'tot_sale_amt_p1',
       'tot_sale_amt_p2', 'avg_basket_value', 'avg_margin', 'avg_quant',
       'avg_disc', 'avg_prods', 'buyer_flag', 'redeem_flag'],
      dtype='object')

In [836]:
master_table_active.loc[:,'multi_cat_flag'] = np.where(master_table_active.No_Distinct_categories ==1, 0, 1)

C:\Users\ravul\AppData\Local\Temp\ipykernel_16356\3934660019.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  master_table_active.loc[:,'multi_cat_flag'] = np.where(master_table_active.No_Distinct_categories ==1, 0, 1)

In [837]:
master_table_active.head()

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed,tot_no_baskets,no_baskets_weekend,...,tot_sale_amt_p1,tot_sale_amt_p2,avg_basket_value,avg_margin,avg_quant,avg_disc,avg_prods,buyer_flag,redeem_flag,multi_cat_flag
1,14634939,M,2012-01-02,2013-02-27,4454.099600,35,2130,11.0,18.0,2.0,...,1211.07,1612.85,156.884444,-3.905001,8.777778,30.426667,6.277778,Repeat,1,1
2,14860694,F,2012-01-03,2013-02-19,2756.280000,19,987,785.0,13.0,2.0,...,1329.98,819.02,165.307692,3.453045,7.615385,47.576923,4.923077,Repeat,1,1
3,85570763,M,2012-01-03,2012-04-06,902.300000,6,240,0.0,1.0,0.0,...,103.50,0.00,103.500000,6.525750,5.000000,5.200000,3.000000,One Time Buyer,0,1
5,85248563,F,2012-01-07,2013-02-03,1702.310000,6,645,0.0,4.0,2.0,...,356.31,855.91,303.055000,-19.201462,7.500000,152.170000,3.250000,Repeat,0,1
6,85006060,M,2012-01-08,2013-03-31,3038.046572,23,288,2995.0,17.0,3.0,...,909.72,1526.39,143.300588,-3.918897,18.823529,64.180588,7.647059,Repeat,1,1

In [838]:
# margin_pct - margin/tot_amt
# discount_pct

In [839]:
master_table_active.tot_mar

1       -70.290014
2        44.889585
3         6.525750
5       -76.805848
6       -66.621247
           ...
22593    45.260000
22594    22.050000
22595    25.420000
22596    -4.480000
22597    28.900000
Name: tot_mar, Length: 20327, dtype: float64

In [840]:
master_table_active.loc[:,'margin_pct'] = np.where(master_table_active['tot_sale_amt'] ==0, 0,\
         master_table_active['tot_mar']/master_table_active['tot_sale_amt'])

C:\Users\ravul\AppData\Local\Temp\ipykernel_16356\3263238413.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  master_table_active.loc[:,'margin_pct'] = np.where(master_table_active['tot_sale_amt'] ==0, 0,\

In [841]:
master_table_active.head()

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed,tot_no_baskets,no_baskets_weekend,...,tot_sale_amt_p2,avg_basket_value,avg_margin,avg_quant,avg_disc,avg_prods,buyer_flag,redeem_flag,multi_cat_flag,margin_pct
1,14634939,M,2012-01-02,2013-02-27,4454.099600,35,2130,11.0,18.0,2.0,...,1612.85,156.884444,-3.905001,8.777778,30.426667,6.277778,Repeat,1,1,-0.024891
2,14860694,F,2012-01-03,2013-02-19,2756.280000,19,987,785.0,13.0,2.0,...,819.02,165.307692,3.453045,7.615385,47.576923,4.923077,Repeat,1,1,0.020889
3,85570763,M,2012-01-03,2012-04-06,902.300000,6,240,0.0,1.0,0.0,...,0.00,103.500000,6.525750,5.000000,5.200000,3.000000,One Time Buyer,0,1,0.063051
5,85248563,F,2012-01-07,2013-02-03,1702.310000,6,645,0.0,4.0,2.0,...,855.91,303.055000,-19.201462,7.500000,152.170000,3.250000,Repeat,0,1,-0.063360
6,85006060,M,2012-01-08,2013-03-31,3038.046572,23,288,2995.0,17.0,3.0,...,1526.39,143.300588,-3.918897,18.823529,64.180588,7.647059,Repeat,1,1,-0.027347

In [842]:
#master

In [843]:
# discount_per -- discount/tot_amt

master_table_active.loc[:,'discount_per']= np.where(master_table_active['tot_act_amt'] ==0, 0,\
         master_table_active['tot_disc']/master_table_active['tot_act_amt'])

C:\Users\ravul\AppData\Local\Temp\ipykernel_16356\294608049.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  master_table_active.loc[:,'discount_per']= np.where(master_table_active['tot_act_amt'] ==0, 0,\

In [844]:
master_table_active.head()

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed,tot_no_baskets,no_baskets_weekend,...,avg_basket_value,avg_margin,avg_quant,avg_disc,avg_prods,buyer_flag,redeem_flag,multi_cat_flag,margin_pct,discount_per
1,14634939,M,2012-01-02,2013-02-27,4454.099600,35,2130,11.0,18.0,2.0,...,156.884444,-3.905001,8.777778,30.426667,6.277778,Repeat,1,1,-0.024891,0.162439
2,14860694,F,2012-01-03,2013-02-19,2756.280000,19,987,785.0,13.0,2.0,...,165.307692,3.453045,7.615385,47.576923,4.923077,Repeat,1,1,0.020889,0.223487
3,85570763,M,2012-01-03,2012-04-06,902.300000,6,240,0.0,1.0,0.0,...,103.500000,6.525750,5.000000,5.200000,3.000000,One Time Buyer,0,1,0.063051,0.047838
5,85248563,F,2012-01-07,2013-02-03,1702.310000,6,645,0.0,4.0,2.0,...,303.055000,-19.201462,7.500000,152.170000,3.250000,Repeat,0,1,-0.063360,0.334274
6,85006060,M,2012-01-08,2013-03-31,3038.046572,23,288,2995.0,17.0,3.0,...,143.300588,-3.918897,18.823529,64.180588,7.647059,Repeat,1,1,-0.027347,0.309332

In [845]:
#promo_prd_pct
# if no_prds = 0 then promo_prd_pct=.; else promo_prd_pct = no_prds_promo/no_prds;

In [846]:
master_table_active.columns

Index(['Customer_ID', 'Gender', 'first_Date', 'recent_date', 'Customer_value',
       'buy_times', 'Points_earned', 'Points_redeemed', 'tot_no_baskets',
       'no_baskets_weekend',
       ...
       'avg_basket_value', 'avg_margin', 'avg_quant', 'avg_disc', 'avg_prods',
       'buyer_flag', 'redeem_flag', 'multi_cat_flag', 'margin_pct',
       'discount_per'],
      dtype='object', length=102)

In [847]:
master_table_active.loc[:,'promo_prd_pct'] = np.where(master_table_active['no_prods'] == 0,\
                                                0,master_table_active['no_prds_promo']/master_table_active['no_prods'])

C:\Users\ravul\AppData\Local\Temp\ipykernel_16356\1060495489.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  master_table_active.loc[:,'promo_prd_pct'] = np.where(master_table_active['no_prods'] == 0,\

In [848]:
master_table_active.head()

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed,tot_no_baskets,no_baskets_weekend,...,avg_margin,avg_quant,avg_disc,avg_prods,buyer_flag,redeem_flag,multi_cat_flag,margin_pct,discount_per,promo_prd_pct
1,14634939,M,2012-01-02,2013-02-27,4454.099600,35,2130,11.0,18.0,2.0,...,-3.905001,8.777778,30.426667,6.277778,Repeat,1,1,-0.024891,0.162439,0.176991
2,14860694,F,2012-01-03,2013-02-19,2756.280000,19,987,785.0,13.0,2.0,...,3.453045,7.615385,47.576923,4.923077,Repeat,1,1,0.020889,0.223487,0.125000
3,85570763,M,2012-01-03,2012-04-06,902.300000,6,240,0.0,1.0,0.0,...,6.525750,5.000000,5.200000,3.000000,One Time Buyer,0,1,0.063051,0.047838,0.000000
5,85248563,F,2012-01-07,2013-02-03,1702.310000,6,645,0.0,4.0,2.0,...,-19.201462,7.500000,152.170000,3.250000,Repeat,0,1,-0.063360,0.334274,0.000000
6,85006060,M,2012-01-08,2013-03-31,3038.046572,23,288,2995.0,17.0,3.0,...,-3.918897,18.823529,64.180588,7.647059,Repeat,1,1,-0.027347,0.309332,0.223077

In [849]:
# pct_pur_w_promo_prds
 # if no_baskets > 0 then pct_pur_w_promo_prds = no_baskets_w_promo_prds/no_baskets; else pct_pur_w_promo_prds = .;

In [850]:
master_table_active.no_baskets_w_promo_prds

1        9.0
2        4.0
3        0.0
5        0.0
6        9.0
        ...
22593    0.0
22594    0.0
22595    0.0
22596    0.0
22597    0.0
Name: no_baskets_w_promo_prds, Length: 20327, dtype: float64

In [851]:
master_table_active.loc[:,'pct_pur_w_promo_prds'] = np.where(master_table_active['tot_no_baskets'] == 0,\
0, master_table_active['no_baskets_w_promo_prds']/master_table_active['tot_no_baskets'])

C:\Users\ravul\AppData\Local\Temp\ipykernel_16356\4025973361.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  master_table_active.loc[:,'pct_pur_w_promo_prds'] = np.where(master_table_active['tot_no_baskets'] == 0,\

In [852]:
master_table_active.head()

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed,tot_no_baskets,no_baskets_weekend,...,avg_quant,avg_disc,avg_prods,buyer_flag,redeem_flag,multi_cat_flag,margin_pct,discount_per,promo_prd_pct,pct_pur_w_promo_prds
1,14634939,M,2012-01-02,2013-02-27,4454.099600,35,2130,11.0,18.0,2.0,...,8.777778,30.426667,6.277778,Repeat,1,1,-0.024891,0.162439,0.176991,0.500000
2,14860694,F,2012-01-03,2013-02-19,2756.280000,19,987,785.0,13.0,2.0,...,7.615385,47.576923,4.923077,Repeat,1,1,0.020889,0.223487,0.125000,0.307692
3,85570763,M,2012-01-03,2012-04-06,902.300000,6,240,0.0,1.0,0.0,...,5.000000,5.200000,3.000000,One Time Buyer,0,1,0.063051,0.047838,0.000000,0.000000
5,85248563,F,2012-01-07,2013-02-03,1702.310000,6,645,0.0,4.0,2.0,...,7.500000,152.170000,3.250000,Repeat,0,1,-0.063360,0.334274,0.000000,0.000000
6,85006060,M,2012-01-08,2013-03-31,3038.046572,23,288,2995.0,17.0,3.0,...,18.823529,64.180588,7.647059,Repeat,1,1,-0.027347,0.309332,0.223077,0.529412

In [853]:
# promo_seeker
# if pct_pur_w_promo_prds <= 0.8 and promo_prd_pct <= 0.5 then Promo_seeker = 0; else Promo_seeker = 1;

In [854]:
master_table_active.loc[:,'Promo_seeker'] =np.where(((master_table_active['pct_pur_w_promo_prds'] <= 0.8) &
          (master_table_active['promo_prd_pct'] <= 0.5)),0,1)

C:\Users\ravul\AppData\Local\Temp\ipykernel_16356\1136128072.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  master_table_active.loc[:,'Promo_seeker'] =np.where(((master_table_active['pct_pur_w_promo_prds'] <= 0.8) &

In [855]:
# master_table_active[master_table_active['Promo_seeker']==1]

In [856]:
#Decile_Sale_amt
#Decile_Margin

In [857]:
master_table_active.loc[:,'Decile_Flag_value'] = pd.qcut(master_table_active['tot_sale_amt'],10,labels= False)
master_table_active.loc[:,'Decile_Flag_margin'] = pd.qcut(master_table_active['tot_mar'],10,labels= False)

C:\Users\ravul\AppData\Local\Temp\ipykernel_16356\3954088367.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  master_table_active.loc[:,'Decile_Flag_value'] = pd.qcut(master_table_active['tot_sale_amt'],10,labels= False)
C:\Users\ravul\AppData\Local\Temp\ipykernel_16356\3954088367.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  master_table_active.loc[:,'Decile_Flag_margin'] = pd.qcut(master_table_active['tot_mar'],10,labels= False)

In [858]:
master_table_active.head()

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed,tot_no_baskets,no_baskets_weekend,...,buyer_flag,redeem_flag,multi_cat_flag,margin_pct,discount_per,promo_prd_pct,pct_pur_w_promo_prds,Promo_seeker,Decile_Flag_value,Decile_Flag_margin
1,14634939,M,2012-01-02,2013-02-27,4454.099600,35,2130,11.0,18.0,2.0,...,Repeat,1,1,-0.024891,0.162439,0.176991,0.500000,0,9,0
2,14860694,F,2012-01-03,2013-02-19,2756.280000,19,987,785.0,13.0,2.0,...,Repeat,1,1,0.020889,0.223487,0.125000,0.307692,0,8,7
3,85570763,M,2012-01-03,2012-04-06,902.300000,6,240,0.0,1.0,0.0,...,One Time Buyer,0,1,0.063051,0.047838,0.000000,0.000000,0,1,3
5,85248563,F,2012-01-07,2013-02-03,1702.310000,6,645,0.0,4.0,2.0,...,Repeat,0,1,-0.063360,0.334274,0.000000,0.000000,0,7,0
6,85006060,M,2012-01-08,2013-03-31,3038.046572,23,288,2995.0,17.0,3.0,...,Repeat,1,1,-0.027347,0.309332,0.223077,0.529412,0,8,0

In [859]:
master_table_active["High_Spender_Flag"]= np.where(master_table_active['Decile_Flag_value'] == 9, 1,0)

C:\Users\ravul\AppData\Local\Temp\ipykernel_16356\1553677165.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  master_table_active["High_Spender_Flag"]= np.where(master_table_active['Decile_Flag_value'] == 9, 1,0)

In [860]:
master_table_active.head()

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed,tot_no_baskets,no_baskets_weekend,...,redeem_flag,multi_cat_flag,margin_pct,discount_per,promo_prd_pct,pct_pur_w_promo_prds,Promo_seeker,Decile_Flag_value,Decile_Flag_margin,High_Spender_Flag
1,14634939,M,2012-01-02,2013-02-27,4454.099600,35,2130,11.0,18.0,2.0,...,1,1,-0.024891,0.162439,0.176991,0.500000,0,9,0,1
2,14860694,F,2012-01-03,2013-02-19,2756.280000,19,987,785.0,13.0,2.0,...,1,1,0.020889,0.223487,0.125000,0.307692,0,8,7,0
3,85570763,M,2012-01-03,2012-04-06,902.300000,6,240,0.0,1.0,0.0,...,0,1,0.063051,0.047838,0.000000,0.000000,0,1,3,0
5,85248563,F,2012-01-07,2013-02-03,1702.310000,6,645,0.0,4.0,2.0,...,0,1,-0.063360,0.334274,0.000000,0.000000,0,7,0,0
6,85006060,M,2012-01-08,2013-03-31,3038.046572,23,288,2995.0,17.0,3.0,...,1,1,-0.027347,0.309332,0.223077,0.529412,0,8,0,0

In [861]:
master_table_active.columns.to_list()

['Customer_ID',
 'Gender',
 'first_Date',
 'recent_date',
 'Customer_value',
 'buy_times',
 'Points_earned',
 'Points_redeemed',
 'tot_no_baskets',
 'no_baskets_weekend',
 'no_baskets_w_promo_prds',
 'tot_quant',
 'tot_sale_amt',
 'tot_disc',
 'discount_items',
 'no_prods',
 'no_prds_weekend',
 'no_prds_promo',
 'cat_prd_cnt_Beauty',
 'cat_prd_cnt_Car_prods',
 'cat_prd_cnt_Digital',
 'cat_prd_cnt_Drinks',
 'cat_prd_cnt_Food',
 'cat_prd_cnt_HH_Electrical',
 'cat_prd_cnt_Home',
 'cat_prd_cnt_Imported_Food',
 'cat_prd_cnt_Kitchen_Clean',
 'cat_prd_cnt_Mobiles',
 'cat_prd_cnt_Mother_Child',
 'cat_prd_cnt_Nutrition',
 'cat_prd_cnt_Office_Computer',
 'cat_prd_cnt_Others',
 'cat_amt_Beauty',
 'cat_amt_Car_prods',
 'cat_amt_Digital',
 'cat_amt_Drinks',
 'cat_amt_Food',
 'cat_amt_HH_Electrical',
 'cat_amt_Home',
 'cat_amt_Imported_Food',
 'cat_amt_Kitchen_Clean',
 'cat_amt_Mobiles',
 'cat_amt_Mother_Child',
 'cat_amt_Nutrition',
 'cat_amt_Office_Computer',
 'cat_amt_Others',
 'cat_pen_Beauty',
 'cat_pen_Car_prods',
 'cat_pen_Digital',
 'cat_pen_Drinks',
 'cat_pen_Food',
 'cat_pen_HH_Electrical',
 'cat_pen_Home',
 'cat_pen_Imported_Food',
 'cat_pen_Kitchen_Clean',
 'cat_pen_Mobiles',
 'cat_pen_Mother_Child',
 'cat_pen_Nutrition',
 'cat_pen_Office_Computer',
 'cat_pen_Others',
 'cat_pur_Beauty',
 'cat_pur_Car_prods',
 'cat_pur_Digital',
 'cat_pur_Drinks',
 'cat_pur_Food',
 'cat_pur_HH_Electrical',
 'cat_pur_Home',
 'cat_pur_Imported_Food',
 'cat_pur_Kitchen_Clean',
 'cat_pur_Mobiles',
 'cat_pur_Mother_Child',
 'cat_pur_Nutrition',
 'cat_pur_Office_Computer',
 'cat_pur_Others',
 'cat_first_Beauty',
 'cat_first_Digital',
 'cat_first_Drinks',
 'cat_first_Food',
 'cat_first_HH_Electrical',
 'cat_first_Home',
 'cat_first_Imported_Food',
 'cat_first_Kitchen_Clean',
 'cat_first_Mobiles',
 'cat_first_Mother_Child',
 'cat_first_Nutrition',
 'cat_first_Office_Computer',
 'No_Distinct_categories',
 'cat_cnt_first_purchase',
 'tot_mar',
 'tot_act_amt',
 'tot_sale_amt_p1',
 'tot_sale_amt_p2',
 'avg_basket_value',
 'avg_margin',
 'avg_quant',
 'avg_disc',
 'avg_prods',
 'buyer_flag',
 'redeem_flag',
 'multi_cat_flag',
 'margin_pct',
 'discount_per',
 'promo_prd_pct',
 'pct_pur_w_promo_prds',
 'Promo_seeker',
 'Decile_Flag_value',
 'Decile_Flag_margin',
 'High_Spender_Flag']

In [864]:
# CustomerSegment
master_table_active["CustomerSegment"] = np.where((master_table_active.tot_sale_amt_p1 == 0) & (master_table_active.tot_sale_amt_p2 > 0),"New",\
                              np.where((master_table_active.tot_sale_amt_p1 > 0) & (master_table_active.tot_sale_amt_p2 == 0),"Churn",\
                              np.where((master_table_active.tot_sale_amt_p1 < master_table_active.tot_sale_amt_p2) ,"UpwardMigrator",\
                              np.where((master_table_active.tot_sale_amt_p1 > master_table_active.tot_sale_amt_p2),"DownWardMigrator",np.nan))))

C:\Users\ravul\AppData\Local\Temp\ipykernel_16356\1366898814.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  master_table_active["CustomerSegment"] = np.where((master_table_active.tot_sale_amt_p1 == 0) & (master_table_active.tot_sale_amt_p2 > 0),"New",\

In [865]:
master_table_active.head()

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed,tot_no_baskets,no_baskets_weekend,...,multi_cat_flag,margin_pct,discount_per,promo_prd_pct,pct_pur_w_promo_prds,Promo_seeker,Decile_Flag_value,Decile_Flag_margin,High_Spender_Flag,CustomerSegment
1,14634939,M,2012-01-02,2013-02-27,4454.099600,35,2130,11.0,18.0,2.0,...,1,-0.024891,0.162439,0.176991,0.500000,0,9,0,1,UpwardMigrator
2,14860694,F,2012-01-03,2013-02-19,2756.280000,19,987,785.0,13.0,2.0,...,1,0.020889,0.223487,0.125000,0.307692,0,8,7,0,DownWardMigrator
3,85570763,M,2012-01-03,2012-04-06,902.300000,6,240,0.0,1.0,0.0,...,1,0.063051,0.047838,0.000000,0.000000,0,1,3,0,Churn
5,85248563,F,2012-01-07,2013-02-03,1702.310000,6,645,0.0,4.0,2.0,...,1,-0.063360,0.334274,0.000000,0.000000,0,7,0,0,UpwardMigrator
6,85006060,M,2012-01-08,2013-03-31,3038.046572,23,288,2995.0,17.0,3.0,...,1,-0.027347,0.309332,0.223077,0.529412,0,8,0,0,UpwardMigrator

In [867]:
master_table_active.to_csv("C://projects/jan_ml/data/output/cust360.csv",index = False)